[
  {
    "id": "bw1279218600000",
    "url": "https://images.firstpost.com/wp-content/uploads/2020/07/Udaan-6401.jpg?impolicy=website&width=1200&height=800",
    "title": "Udaan",
    "gist": "Expelled from his school, a 16-year old boy returns home to his abusive and oppressive father.",
    "summary": "It's not the most original movie but its got a nice progresiveness to it. It has good acting and not a very bollywoodesque style directing which makes it a little more interesting.",
    "category": "bollywood",
    "date": "16 July 2010",
    "contents": [
      {
        "type": "pg",
        "content": "After being abandoned for eight straight years in boarding school, Rohan returns to the small industrial town of Jamshedpur and finds himself closeted with an authoritarian father and a younger half brother who he didn't even know existed. Forced to work in his father's steel factory and study engineering against his wishes, he strives to forge his own life out of his given circumstances and pursue his dream of being a writer."
      },
      {
        "type": "pg",
        "content": "Vikramaditya Motwane's 'Udaan' is a film, that lingers your memory, and gives you the hope to live your dreams. The film has everything going for it, it has a touching story, proficient performances, hummable music & striking direction. It's A Winner All The Way!"
      },
      {
        "type": "pg",
        "content": "Rajat Barmecha stars as Rohan, who, after being abandoned for eight straight years in boarding school, returns to the industrial city of Jamshedpur and finds himself closeted with an authoritarian father and a younger half brother who he didn't even know existed."
      },
      {
        "type": "pg",
        "content": "'Udaan' is an inspiring story. Screenplay by Motwane & Anurag Kashyap is brilliant. Their protagonist, is not a passive one, he has a goal, that of becoming a writer, which has been stabbed by his authoritarian father. The Screenplay allows it's Hero to get courage in himself. It starts superbly, and continues it's momentum to the end."
      },
      {
        "type": "ig",
        "url": "https://1.bp.blogspot.com/__rfGD3ZOjEM/TD8tAakCQ5I/AAAAAAAAAsQ/8Cxg1psxTtw/s1600/Udaan+Movie.gif"
      },
      {
        "type": "pg",
        "content": "Motwane's direction is great as well. The Cinematography is able. Amit Trivedi's Music is hummable. The Editing is killer."
      },
      {
        "type": "pg",
        "content": "Performance-Wise: Rajat Barmecha is wonderful. The youngster lives his character each moment. Ronit Roy as the authoritarian father, is electrifying. The actor performs like never before! Aayan Boradia is a wonder child. A dependable actor! Ram Kapoor as the polite & understanding uncle, is lovable. Manjot Singh appears fictitious."
      },
      {
        "type": "pg",
        "content": "On the whole, as my summary says, One Of The Finest Films Of 2010! Strongly Reccmended!"
      }
    ],
    "time": "7",
    "badges": ["bollywood", "drama"],
    "likes": "461",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1261679400000",
    "url": "https://www.filmibeat.com/ph-big/2011/11/1322117153482891.jpg",
    "title": "3 Idiots",
    "gist": "Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them 'idiots'.",
    "summary": "Farhan Qureshi and Raju Rastogi want to re-unite with their fellow collegian, Rancho, after faking a stroke aboard an Air India plane, and excusing himself from his wife - trouser less - respectively. Enroute, they encounter another student, Chatur Ramalingam, now a successful businessman, who reminds them of a bet they had undertaken 10 years ago. The trio, while recollecting hilarious antics, including their run-ins with the Dean of Delhi's Imperial College of Engineering, Viru Sahastrabudhe, race to locate Rancho, at his last known address - little knowing the secret that was kept from them all this time.",
    "category": "bollywood",
    "date": "25 December 2009",
    "contents": [
      {
        "type": "pg",
        "content": "Like so many Indian films, this is a very, very long film--with a run-time of almost three hours. When a movie is bad or just okay, this can seem like forever, but since '3 Idiots' is a very, very good film I loved its length. And, like most films of the genre, it has its share of the usual singing and dancing so foreign to films from other countries. One thing you should know, however, is that defining the type of film it is isn't really easy. Much of it is a comedy, but it also has many poignant moments (keep the Kleenex nearby), some existential moments where they explore the meaning of life and work and it's also a tender film about friendship. And, as my daughter pointed out when she saw the film, she loved that the men in the movie are not afraid to cry--something you rarely see in western films."
      },
      {
        "type": "pg",
        "content": "As for the plot, it's very long and involved and I could recount what occurs. But I don't want to spoil a single wonderful moment, so my advice is just sit back and watch--and if you give it a chance, I can almost guarantee you'll have a great time with this poignant and funny film. Wonderful and well worth your time--with a delightful script, wonderful characters and lots of moments that made me smile...and a few that brought me to tears. See this film."
      },
      {
        "type": "pg",
        "content": "In short, 3 Idiots is a full course meal of a movie, and it has so many types and moods of movie stuffed into one, like a Turducken or something: it's a broad college comedy, an Alvin and the Chipmunks farce (think about it, with Khan's Rancho as Alvin and the other two idiots variations of Simon and Theodore, sort of, plus the Chatur character as the 4th wheel), a soap opera about strict fathers and their children, a tragic tale about suicide meant to highlight a very real problem in Indian society, and of course for Bollywood a musical, not to mention a kind of moral story of what it means to be a teacher or a student and how to not be so uptight (another subtitle for this movie could be 'The System, They Just Don't Understand!')."
      },
      {
        "type": "pg",
        "content": "It's even other things I'm sure, and the tones fluctuate and alter on a dime from one to the next. Case in point, there's a little more than mid-way through the film a very serious turn in the plot; nevermind how exactly it gets there, suffice it to say it's due to some late-night antics from Rancho with pals Raju and Farhan, with Raju most drunk the next morning in class and being forced to decide whether to be expelled or put it all on Rancho. Raju decides to jump out the window, though he doesn't die and he subsequently gets rushed to the hospital. Cue up the sad but (it can't be anything else) supremely heart-felt song that plays over as he is brought to stable condition. Then it becomes a rather crazy comedy of 'how do we wake up Raju' sequence as he is stuck in his, uh, comatose-sort of state and Rancho keeps saying wilder and wackier things to get Raju to wake up. And yet as broad as this is it's still serious... sort of."
      },
      {
        "type": "ig",
        "url": "https://stat1.bollywoodhungama.in/wp-content/uploads/2016/05/439558148.jpg"
      },
      {
        "type": "pg",
        "content": "A lot of this happens throughout 3 Idiots; for a stretch of time the movie will take on something like a frat-house comedy (that's actually how the film seems like it will take shape early on, 'initiation' sequence with butt-branding included!) but then it's (duh) also a romance with the headmaster/principal's daughter, Pia (Kapoor, pretty but also a very good actress) and Rancho since he not only is the cool/suave prankster but he also spots the phonies who try to have her hand as a significant other. But then it's also about Raju's sad (in black and white no less!) home life, and then it's also about how to function properly in an academic environment with Rancho sometimes like a, uh, RP McMurphy in Cuckoo's Nest turning the system upside down with the headmaster as the one-note headmaster. And then it gets into a musical number about things like 'All is Well', which gets finished off by someone jumping off a ledge and to their death, which makes it uh... sad again, as it cuts to the pouring rain at a funeral."
      },
      {
        "type": "pg",
        "content": "This may be de rigeur for those who are regulars for Bollywood cinema - for me, it was at times a startling experience, sometimes akin to getting whiplash on a roller-coaster. This is not to say it made the experience intolerable, however. It was surely made as a prestige/high-mainstream comedy/drama/musical-et-al, and it's the kind of movie that will have high-powered, super-slick musical set pieces (not quite as many as I expected, to be fair, and those that are here do stand out well and are the highlights of the movie aside from Khan's performance), and then for the regular musical score it will be some of the goofiest notes I've ever heard outside of a Disney channel show. And for as BIG as the actors go for this material - perhaps, you could argue, they don't have much of a choice - there are moments where there's something close to not subtlety but measured stuff; when Raju confronts his parents with what he actually wants to do with his life, it's a legitimately strong dramatic scene that pulls on the heartstrings just enough."
      },
      {
        "type": "pg",
        "content": "In other words, it's probably not what will be the *best* Bollywood movie - some may put it high up there, and that's their prerogative - but if you are new to this style of movie-making (and I don't mean Slumdog Millionaire for the laymans that's basically Bollywood crossed with Danny Boyle), it's a good place to start. It's sometimes quite funny, and sometimes quite harrowing with its drama, and often it's much too much with the emotional manipulation (that delivery scene, my God). It is what it is."
      }
    ],
    "time": "10",
    "badges": ["comedy", "bollywood", "drama"],
    "likes": "121",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1310668200000",
    "url": "https://i0.wp.com/filmeshilmy.com/wp-content/uploads/2020/07/ZNMD.jpeg?fit=3600%2C2118&ssl=1",
    "title": "Zindagi Na Milegi Dobara",
    "gist": "Three friends decide to turn their fantasy vacation into reality after one of their friends gets engaged.",
    "summary": "Three friends decide to turn their fantasy vacation into reality after one of their friends gets engaged.",
    "category": "bollywood",
    "date": "15 July 2011",
    "contents": [
      {
        "type": "pg",
        "content": "This is what buddy road trip movies are made of, and surprisingly it's helmed by a female director who managed to push all the right buttons at making this work. Zoya Akhtar, whose first film Lucy By Chance I had enjoyed tremendously as it took a long and hard look into the workings of Bollywood, reunites her brother Farhan Akhtar and Hrithik Roshan, who together with Abhay Deol form the nucleus whose adventures across Spain we follow due to a pact that's set in motion should one of them was to get married, as part of an extended 3 weeks bachelor's party plan, they were to each choose an adventure sport for everyone to partake in."
      },
      {
        "type": "pg",
        "content": "Which brings us to plenty of bro-mantic moments as they bond over death-defying stunts, and through the conquering of their fears as a group. Not to mention that the road trip across Spain provides for multiple exotic locations in which this film got shot in. Zoya Akhtar and Reema Kagti's story also contains enough depth for each character to stand out, presenting skeletons in the closet each must exorcise through their journey of discovery, though deftly avoiding melodrama. What worked is of course the chemistry between the trio of actors as they navigate their joined quest being so natural in their banter, as well as their individual character's conflicts that makes this so engaging to sit through since the challenges in their way are things easy to identify with."
      },
      {
        "type": "pg",
        "content": "The culprit who had to put the plan in motion is Kabir (Deol), whose proposal to Natasha (Kalki Koechlin) forms the basis in which his friends have to join him in executing their pact. There's the happy-go-lucky copywriter Imran (Farhan Akhtar) who's also the resident joker of the group, as well as the dead serious Arjun (Roshan) the hotshot broker whose sole objective in life is to make money, lots of it. Naturally their friendship get tested early on due to the nature of being in close proximity most of the time, but once the misunderstandings got shelved and the wheels put in motion, there's hardly a wasted scene as subplots wrap themselves up very neatly in the narrative, involving one's quest to search for his long lost father, another's realization there's more to life than work if one were to stop and smell the perennial roses, and one having to confront his doubts and the compromise of one's happiness for the sake of others."
      },
      {
        "type": "ig",
        "url": "https://images.thequint.com/thequint%2F2021-07%2F164cebd4-b9ef-4dda-af8b-8ae39a4da184%2FUntitled_design__25_.png"
      },
      {
        "type": "pg",
        "content": "There's the action-adventure level this film delivered, spending considerable time in engaging the casts in their tasks of deep sea diving, sky diving, and one signature activity best kept under wraps for its surprise factor since it ties in very closely to an important plot point. Halfway though there's also the La Tomatina festival, introduced by Laila (Katrina Kaif) their diving instructor and would be romantic interest, as an unplanned detour involving the squishing of a massive amount of tomatoes - one wonders though if the timelines of all activities do gel together so nicely since there were at least two festivals almost back to back with each other."
      },
      {
        "type": "pg",
        "content": "Hrithik Roshan didn't have much luck at the box office last year with Guzzarish and Kites, but Zindagi Na Milegi Dobara will probably put his career back on track given the meatier role of the trio he got to handle. Farhan Akhtar should act more when he's not directing his own films, while Abhay Deol after this has established himself in my books as one of the character actors to look out for. With great scenic shots and an evergreen story about friendship, camaraderie and life affirming decision making, there's nothing not to like about this film that reminds us of the ties that bind. Highly recommended as it inspires one to come up with a similar pact for a road trip."
      }
    ],
    "time": "8",
    "badges": ["bollywood", "comedy", "drama"],
    "likes": "485",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1438281000000",
    "url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2018/07/pjimage-1533022007.jpg",
    "title": "Drishyam",
    "gist": "Desperate measures are taken by a man who tries to save his family from the dark side of the law, after they commit an unexpected crime.",
    "summary": "In a bizarre turn of events; a teenage boy goes missing; he is the son of a headstrong & no-nonsense cop; IG Meera Deshmukh and the Salgaonkar family is the prime suspect! How the family weathers the storm that ensues during the violent investigation forms the rest of the story leading to an unexpected & shocking climax.",
    "category": "bollywood",
    "date": "31 July 2015",
    "contents": [
      {
        "type": "pg",
        "content": "It's easy to feel conflicted about the story presented by 'Drishyam'. After all, there's an unjustified death that took place, and an entire family gets behind a plan to cover it up. To my thinking, the kid Sam was a victim of manslaughter and not attempted murder, but not knowing how the law deals with these things in India, I'd have to assume that the penalty would have been almost as severe as actual homicide. When Vijay Salgaonkar (Ajay Devgn) decides that he'll pull out all the stops to protect his family, the intrigue and suspense mounts in this rather offbeat thriller."
      },
      {
        "type": "pg",
        "content": "The other facet of this story that baffles me somewhat is why teenage daughter Anju (Ishita Dutta) became so distraught over the cell phone video. At first one doesn't know under what circumstances she was recorded, but it's eventually revealed that she merely went into a bathroom to change her clothes and the peeping Sam caught her in a state of undress. It's not as if she were intentionally engaging in a pornographic film. But again, different cultures look at things differently, and teenagers in particular aren't amenable to rational thought at times. So one can understand why she took matters into her own hands when Sam came calling."
      },
      {
        "type": "ig",
        "url": "https://m.media-amazon.com/images/M/MV5BYTM5YmNjMTItNjQ1Ny00MWY4LTg1MzctMzRlYWQ4OGE2YWZjXkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg"
      },
      {
        "type": "pg",
        "content": "The odd thing that occurs over the course of the picture is that the viewer finds himself siding with Vijay and the family over the cover up. That's made easier of course by the corrupt methods of the IG of Goa, portrayed by Indian actress Tabu, as well as the brutal tactics of Inspector Gaitonde (Kamlesh Sawant). If he couldn't get the three eldest members of the Salgaonkar family to crack, it was pretty much a foregone conclusion that he would have forced young Anu (Mrunal Jadhav) to talk. But by the time the authorities arrived to dig up the family's backyard, and seeing to what lengths Vijay had already gone to cover the family's tracks, I had a strong suspicion he had tampered with the grave. It was only a matter of suspense to find what he replaced Sam's body with."
      },
      {
        "type": "pg",
        "content": "Apparently this movie is a faithful remake of another Indian film with the very same title, which I find intriguing in one respect. As I write this, the film under consideration here is ranked in IMDb's Top #250 for 2016, but sits at #21 on the best films of India, while the original 'Drishyam is #2. How that anomaly occurs I wouldn't know, but it's an interesting little side note. To my mind, I think the ending of film would have been better served without the final confrontation between the Deshmukh family and Vijay, though I did find some irony in the idea that Sam was reburied under the floor of the new prison."
      }
    ],
    "time": "11",
    "badges": ["bollywood", "crime", "drama", "mystery"],
    "likes": "245",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1437676200000",
    "url": "https://m.media-amazon.com/images/M/MV5BNGVkYTdhY2MtNWE5NS00MzY5LWJkNDEtNDUxNWE5NGRlMmFjXkEyXkFqcGdeQXVyODMyODMxNDY@._V1_.jpg",
    "title": "Masaan",
    "gist": "Along India's Ganges River, four people face prejudice, a strict moral code and a punishing caste system as they confront personal tragedies.",
    "summary": "Four lives intersect along the Ganges: a low caste boy hopelessly in love, a daughter ridden with guilt of a sexual encounter ending in a tragedy, a hapless father with fading morality, and a spirited child yearning for a family, long to escape the moral constructs of a small-town.",
    "category": "bollywood",
    "date": "24 July 2015",
    "contents": [
      {
        "type": "pg",
        "content": "Neeraj Ghaywan's 'Masaan' is packed with strong performances, but as a tale, its flawed & not as gut wrenching as it believes to be. This Two-Story based narrative is certainly not without some merit, but it could've been so much more."
      },
      {
        "type": "pg",
        "content": "'Masaan' Synopsis: Four lives intersect along the Ganges: a low caste boy hopelessly in love, a daughter ridden with guilt of a sexual encounter ending in a tragedy, a hapless father with fading morality, and a spirited child yearning for a family, long to escape the moral constructs of a small-town."
      },
      {
        "type": "pg",
        "content": "'Masaan' aces in its first story, which is genuinely tragic. The father-daughter angle is powerfully handled, offering moments so real, they literally hit you like ton of bricks. My problem was with the second story. I couldn't care less for the low-caste boy who falls for a girl, who turns out to be his opposite, in terms of caste."
      },
      {
        "type": "ig",
        "url": "https://lh3.googleusercontent.com/proxy/bb5he02-ymEecwOEpD7u9yc4jjLgXumteQTDA2aiVj3gEodtcQI60XgCwVTeZEenkKZLOfemd8gJB8wpgLfy8yugcGQIM0_Ogqi-Jkmn6IleUWTiYhHvjqggmBgoRUDe_LL9OpZxSTQEfsQsM1hQUxP1qMhF9jKO56jONdN-P8oM-_uqYwz9ESdrgN4C2o_ecn8U-c-E3ulBT9fRnuqGR0mW8pzJ6uJ5"
      },
      {
        "type": "pg",
        "content": "Ghaywan & Varun Grover's Screenplay solidly builds one story, but fails in the another one. I wasn't repulsed by the goings-on, although the Writing aims to disturb you. The Writing needed to be sharper. Ghaywan's Direction is good. Cinematography & Editing are perfectly done."
      },
      {
        "type": "pg",
        "content": "Performance-Wise: Richa Chadda & Sanjay Mishra lead 'Masaan', with heartbreaking performances. As the conflicting father-daughter, Chadda & Mishra deliver magnificently. Newcomer Vicky Kaushal & Shweta Tripathi are sincere. Pankaj Tripathi is priceless in a cameo."
      },
      {
        "type": "pg",
        "content": "On the whole, 'Masaan' isn't as powerful as it hopes to be, but its still worth a watch for the performances."
      }
    ],
    "time": "10",
    "badges": ["bollywood", "drama"],
    "likes": "520",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1373481000000",
    "url": "https://variety.com/wp-content/uploads/2013/07/bhaag-milkha-bhaag.jpg",
    "title": "Bhaag Milkha Bhaag",
    "gist": "The truth behind the ascension of Milkha Singh who was scarred because of the India-Pakistan partition.",
    "summary": "The true story of the 'Flying Sikh' - world champion runner and Olympian Milkha Singh -- who overcame the massacre of his family, civil war during the India-Pakistan partition, and homelessness to become one of India's most iconic athletes.",
    "category": "bollywood",
    "date": "11 July 2013",
    "contents": [
      {
        "type": "pg",
        "content": "'Bhaag Milkha Bhaag' is a film about the life of Milkha Singh--a man who is beloved in India but who I'd never heard about before I saw this movie. He is about the most famous Olympic non-winner you can find--and the film begins with him coming in 4th in the 400 at the Rome Olympics."
      },
      {
        "type": "pg",
        "content": "The film is non-liner in style, as it goes from this even in 1960 back a few years to when Singh enlisted in the Indian Army to his childhood. But, unusually, it bounces back and forth repeatedly--and might confuse some viewers."
      },
      {
        "type": "ig",
        "url": "https://www.filmibeat.com/img/2013/06/05-sonam-farhan-b-050613.jpg"
      },
      {
        "type": "pg",
        "content": "The big reason for this film is not only because Singh was a three-time Olympian (only two times are mentioned in the film) or an Asian champion but because of his roots. He was born in a region that was India but became part of Pakistan after the partition in 1947. This was a serious problem for Singh and his family, as they were Sikhs--and non-Muslims were apparently not welcome there. This isn't surprising, as the partition resulted in the deaths of anywhere from 200,000 to a million according to some estimates--on both sides of the border (everybody seemed to be killing each other in the name of god!). So, that Singh's family was displaced and his father murdered isn't surprising. Years later, the Indians and Pakistanis were planning a joint competition--and Singh would be an important part of that team. However, because of his past, his participation was doubtful and the film chronicles this."
      },
      {
        "type": "pg",
        "content": "While this is a sports drama, I wasn't surprised that, yes, there were still several song and dance numbers. Not all Indian films have this but a huge percentage do--so expect a few nice musical interludes. Additionally, expect AMAZING cinematography, direction and special effects--making it equal in quality to the films of any nation. What really impressed me as well as Farhan Akhtar as Singh. Farhan really buffed himself up for the film and was a very impressive looking guy with his taut figure and muscles. He really LOOKED like a world-class athlete. Overall, an enjoyable film and one well worth your time."
      }
    ],
    "time": "9",
    "badges": ["bollywood", "drama", "sport", "biography"],
    "likes": "461",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1394130600000",
    "url": "https://www.filmibeat.com/ph-big/2014/02/kangna-ranaut-still-from-film-queen_139288557480.jpg",
    "title": "Queen",
    "gist": "A Delhi girl from a traditional family sets out on a solo honeymoon after her marriage gets cancelled.",
    "summary": "Queen is a movie about growing up. Rani (Kangana Ranaut) is a Delhi girl from a conservative family who is ditched by her fiancé just before her wedding. Shocked by this, she decides to set out on the planned honeymoon alone. As she travels the world and meets new people, she gains new experiences and discovers her own identity.",
    "category": "bollywood",
    "date": "7 March 2014",
    "contents": [
      {
        "type": "pg",
        "content": "Directed by Vikas Bahl, QUEEN actually works instantly since it breaks all the set molds of a Hindi film as soon as the girl moves out to her foreign destination to enjoy a honeymoon alone! And when in Paris, you get to see her coming out of her closed, conservative shell like no other Hindi film has shown till date, to be honest. Yes, the plot does remind you of films such as FRENCH KISS (1995) and our own English VINGLISH (2012) also based on a lady's self discovery. But the similarities end right there and QUEEN comes out as a true representative of the new age entertaining cinema, we have been looking for from quite long."
      },
      {
        "type": "pg",
        "content": "The film is a winner straight away since it remains unpredictable right from its first scene till the last, offering many unseen sequences in a remarkable style. And then it's a very fresh, lively and honest depiction of the foreign life which truly adds to the overall feel of the film quite brilliantly. The other major winning perspective of QUEEN is that this is not a stereotype love story being told with a foreign angle. In fact it is not a love story at all in the first place and is more about the blessed journey of a depressed girl, who rediscovers a new self, after meeting another girl living her life at her own terms all alone, taking its full responsibility whatsoever."
      },
      {
        "type": "pg",
        "content": "So actually QUEEN is all about women-liberation, but this liberation is not meant from any evil clutches of the men. On the contrary here the liberation is pointing towards getting free from herself and from her own set parameters which force her to questionably give away the reins of her life in the hands of a man, without asking any questions or getting any clear commitments for the future. It's a 150 minutes joyride which is certainly going to be enjoyed more by the women as its about them and their undisclosed aspirations only which remain hidden in most of the cases just to get buried or burnt along with their lifeless bodies in the end. So for a change, here we have the men playing the supporting cast taking the rarely acquired back seat and the film is all about the women superbly led by one of the most under-rated actress of our times, Kangana Ranaut."
      },
      {
        "type": "ig",
        "url": "https://www.filmibeat.com/ph-big/2014/01/kangna-ranaut-still-from-film-queen_1388647010100.jpg"
      },
      {
        "type": "pg",
        "content": "As clearly conveyed in its promos, QUEEN begins with Kangana and ends on Kangana too like very few Hindi films dare to do. The immensely talented girl who was mostly considered as a misfit in the fixed Bollywood format earlier just grabs this rare opportunity thrown towards her like a wounded tigress and then delivers a performance which is sure going to give a tough competition to her contemporaries like Parineeti Chopra, Alia Bhatt and more in the next rounds of awards ceremonies, without any doubt. Her flawless, natural act is simply spectacular in the film as Rani played in a cheerful mode. Plus such is the innocent brilliance in her truthful performance that the viewer just has the girl only in his or her mind while walking out of the theater and that too with all positivity and smile on the faces in a highly satisfying mode."
      },
      {
        "type": "pg",
        "content": "However beginning with a highly enjoyable & entertaining first half, the film does tend to become a bit long in its few sequences of the second half (which required a wise editing). Plus it also takes some (fairly allowed) cinematic liberties in its basic storyline too leaving quite a few things unexplained about its key characters in the end. But fortunately Kangana never lets you feel these shortcomings frankly and the progression even makes a more solid impact once she returns back home and decides to do the unexpected quite daringly. The climax fills in a new life back into the film and I was really relieved that it didn't have something of the routine in its final moments."
      },
      {
        "type": "pg",
        "content": "Apart from the spellbinding act by Kangana, the other great insightful features of the film deserving a special mention are its writing (dialogues), cinematography, costume designing and background score which give an extremely important and appreciable edge to the product in terms of 'A Balance maintained.'"
      },
      {
        "type": "pg",
        "content": "Musically, QUEEN has indeed got a worth listening, interesting soundtrack with a few peppy dancing tracks like 'London Thumakda', 'O Gujariya', 'Jugni' and more soothing ones such as 'Badra Bahaar', 'Taake Jhaanke', 'Harjaaiyan', 'Ranjha' & 'Kinare' sung well. Moreover it also teaches how a perfect tribute can be paid to the great songs of our Golden Era by using the track 'Maine Hothon Se Lagayi To' from ANHONEE in a superb style with some fine added arrangements."
      },
      {
        "type": "ig",
        "url": "https://static.toiimg.com/photo/msid-31528654/31528654.jpg?53275"
      },
      {
        "type": "pg",
        "content": "In the supporting cast, Rajkummar Rao shines in his short role and it was really sporting of him to accept such a miniscule part at this crucial time of his career. Lisa Haydon is truly a delight to watch both in terms of beauty and dialogues complimenting Kangana in her every next step with confidence and all the foreign actors do add their own bit sincerely to make it a worth watching film in its final hour. Still, the ones really giving you a great time in the theater are the actors playing Kangana's family members especially the father, kid brother and the grandmother giving her a lovely life teaching advice sitting out of the locked door."
      },
      {
        "type": "pg",
        "content": "To sum up QUEEN is a charmingly entertaining film, which many might rate as just a multiplex movie or something taking our Indian traditions for a toss and more. But for others QUEEN is the next step forward in our Indian Cinema and the effort surely needs to be applauded by one and all, loudly."
      }
    ],
    "time": "12",
    "badges": ["bollywood", "comedy", "drama", "adventure"],
    "likes": "319",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1331231400000",
    "url": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2016/12/02/524885-26tweet1.jpg",
    "title": "Kahaani",
    "gist": "A pregnant woman's search for her missing husband takes her from London to Kolkata, but everyone she questions denies having ever met him.",
    "summary": "Kolkata is abuzz with the preparations for the annual Durga Puja festival, as seven months pregnant Vidya Bagchi steps off the airplane from London. Her first stop is the local police station to file a missing person report. Weeks ago, her husband Arnab arrived in India for a job assignment. The first two weeks, they talked daily on the phone, and then without explanation, his calls stopped. Everywhere Vidya turns, no one can remember Arnab. There is no trace of him at the guest house or his workplace. But Vidya will not give up her search. Somewhere in Kolkata she will discover the dangerous truth",
    "category": "bollywood",
    "date": "9 March 2012",
    "contents": [
      {
        "type": "pg",
        "content": "If you are looking for a typical sort of Bollywood film where you have a romance and LOTS of singing, then 'Kahaani' is not for you. While I like the former sort of film, here in the States MOST Indian films we get are like that and so it's nice to have something very different--and 'Kahaani' is very different."
      },
      {
        "type": "pg",
        "content": "Vidya Balan plays a woman named Vidya. She's lived in London and although she speaks Hindi, she is very westernized. So, when her husband, Arnab, disappears, she is not like a typical Indian woman--she goes looking for him--even if it means leaving her London home when she is obviously VERY pregnant (heck, she looks like she's ready to explode during the film!). However, when she arrives in Kolkata, she finds no evidence that Arnab ever went there on a business trip. The police assist her but they also come up with nothing. However, the woman in human resources where Arnab claimed to be working thinks that perhaps Arnab is a DIFFERENT employee--a guy name Milan that worked there two years ago. Unfortunately for the H.R. woman, this ends up costing her her life! Obviously something very bad and very dangerous is afoot. To discover exactly what and who's behind it, watch 'Kahaani'. I could tell you more--as the film really packs a lot into only two hours--but it also would impact your enjoyment and give away way too much. Just see the film."
      },
      {
        "type": "ig",
        "url": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2020/04/28/Pictures/_4a39a422-8918-11ea-9509-5815dbde8d81.jpg"
      },
      {
        "type": "pg",
        "content": "There really isn't much to complain about in this film. The writing is VERY original but more importantly, it's very INTELLIGENTLY written and is made for an audience who doesn't mind a complex plot or strong female lead--especially for an Indian film. I also LOVED the balding assassin--he was so scary because he seemed so incredibly ordinary! All in all, a great film--one of the best I've seen from India and comparable to the best stuff made anywhere."
      }
    ],
    "time": "10",
    "badges": ["bollywood", "mistery", "thriller"],
    "likes": "253",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1138213800000",
    "url": "https://m.media-amazon.com/images/M/MV5BODI5ZGVhY2ItYTFlMi00MjBhLTk5YTItNzg4NmZlZWEzNWIzXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg",
    "title": "Rang De Basanti",
    "gist": "The story of six young Indians who assist an English woman to film a documentary on the freedom fighters from their past, and the events that lead them to relive the long-forgotten saga of freedom.",
    "summary": "Sue comes to India to make a film on Indian revolutionaries. She is helped by her friend Sonia who introduces her to her friends Karan, Aslam, Sukhi, and their head DJ. Sonia's fiance, Lt Ajay Rathod, also joins the gang when in town. Their gang always gets in trouble with political member Laxman who opposes their Western culture. After many auditions Sue decides to cast DJ and his friends in her film; she also gives Laxman a role, ending his feud with the gang. Everything goes well until Ajay dies in a plane crash but manages to save everyone else on board. The state minister declares that Ajay died due to his own negligence. DJ an his friends can't take this shame given to Ajay by the minister and decide to fight for justice, but political games interfere.",
    "category": "bollywood",
    "date": "26 January 2006",
    "contents": [
      {
        "type": "pg",
        "content": "Sue is a pretty young British lady who wants to make a film about the Indian uprising of the 1920s. This is because she's read through her grandfather's diary and although he was a British officer, he had great respect for these Indian patriots. But her bosses have no interest in such a project (perhaps because she's in the UK), so she takes off for India to do the film herself...with no funding. But because there is no money, she decides to use some college students instead of professional actors. There is a huge problem, though, as the students are mostly very spoiled young people who are more interested in becoming like Westerners than doing a serious film about their forefathers. Can she get through to these jerks and get them to realize the great price that was paid to create modern day India....and thus get the film made?"
      },
      {
        "type": "ig",
        "url": "https://occ-0-1723-1722.1.nflxso.net/dnm/api/v6/E8vDc_W8CLv7-yMQu8KMEC7Rrr8/AAAABTLvyHuqI7JoGOsljH6mhvFf5gS1zMtfDOl2m4O06ol3eJ6JQd8FsVzxPzJnh3wezhIUy2Moz2jEkbuLWrkZx3Oo4uQ6.jpg?r=504"
      },
      {
        "type": "pg",
        "content": "Like most Indian films, this one is quite long--nearly three hours. And, like a typical Indian film is shows a lot of fun-loving young Indians singing and dancing. I liked the film but think they overdid this aspect a bit. The students should have been oblivious to their past but making them annoying jerks seemed a bit too much, as it was very hard to like any of them during the first portion of the picture. A bit more subtlety would have been nice. Fortunately, through the course of the film, the students did improve in this regard and began to take the project more seriously. This later portion was much better and poignant, as the students start to realize that even today in India there is corruption and repression that must be fought and it's a close parallel to the story about the Indian revolutionaries of the 1920s. I am pretty sure the Indian politicians did NOT appreciate this film and its condemnation of brutal police tactics to squelch protest! Overall, despite being uneven, the film is quite good and interesting as it seems to encourage what might be perceived as terrorism! A very compelling film despite the slow start."
      },
      {
        "type": "pg",
        "content": "By the way, the MiG-21 crashes which made up a significant part of the latter portion of film have apparently been a serious problem in India. And yet, the film says at the beginning that it's a work of fiction...interesting. Also, for Westerners not used to Bollywood films, you might be interested to hear that corruption (particularly police corruption) is a relatively common theme in Indian films."
      }
    ],
    "time": "12",
    "badges": ["bollywood", "comedy", "crime", "drama"],
    "likes": "793",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1186684200000",
    "url": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/08/09/Pictures/_4980d7a6-7d06-11e7-a713-31f90463e8eb.jpg",
    "title": "Chakde! India",
    "gist": "Kabir Khan, the coach of the Indian Women's National Hockey Team, dreams of making his all-girls team emerge victorious against all odds.",
    "summary": "CHAK DE INDIA is the story of a coach's fight of making his team, Team India by overcoming their diverse backgrounds, by learning to use everything that life hurls on them as a secret weapon. It's a story about honesty, sincerity and integrity.",
    "category": "bollywood",
    "date": "10 August 2007",
    "contents": [
      {
        "type": "pg",
        "content": "I am not what you would call a sports fan. I do not get any vicarious thrill watching someone else do what I can't. I appreciate great sportsmen/women like Tiger Woods or Lorena Ochoa or Danica Patrick, but I generally avoid watching unless it is a national event like the World Cup or the Olympics."
      },
      {
        "type": "pg",
        "content": "Having said that, I am a huge fan of sports movies. They are a source of excitement and inspiration if they are done well. This one is one of the best that I have seen."
      },
      {
        "type": "ig",
        "url": "https://m.media-amazon.com/images/M/MV5BMTk2NjUzMzc2OV5BMl5BanBnXkFtZTgwMDM4MTcxMzI@._V1_.jpg"
      },
      {
        "type": "pg",
        "content": "It has so many good points, that it is hard to list them all. The obsession with national pride and the fact that a star player is scapegoated for a loss is first and foremost in this film. We are all allowed to make one mistake, aren't we? Not if your mistake costs the country to lose a title and lose face to a huge enemy. Kabir Khan (Shahrukh Khan) made such a mistake and it caused him to leave his home and go into exile for seven years."
      },
      {
        "type": "pg",
        "content": "He returned to take a job that no one wanted. He would coach a women's hockey team to the World Championships. No one wanted it because it was a women's team, and we all know that is usually just a Title IX requirement and not to be taken seriously. In fact, they didn't even want to fund the trip to the World Championships after he trained the team. Money was to be used for a men's team. Women belong barefoot and pregnant and in the kitchen, as one Arkansas politician put it some years ago."
      },
      {
        "type": "pg",
        "content": "To watch 150+ minutes of women's hockey, you have to have one hell of a story and some very interesting characters. The challenge of Khan transforming sixteen championship players from all over India into a team that puts India first, was mesmerizing. You know how the story will end. It ends as all sports movies do, but it is the journey that is fascinating. To see the neanderthal attitudes of the country transformed through excellence in sport is both exciting and sad. (Don't be so smug, America, your record on women isn't too much better.) If you are looking for an exciting movie that will thrill you beyond belief, then this is the one. Do not miss it."
      }
    ],
    "time": "12",
    "badges": ["bollywood", "drama", "family", "sport"],
    "likes": "365",
    "author": "sn1637324823541"
  },
  {
    "id": "tv1629484200000",
    "url": "https://cdn.pixabay.com/photo/2016/10/14/19/21/canyon-1740973_960_720.jpg",
    "title": "Closer to the Canyon",
    "gist": "The movement of rivers, the processes of weathering and erosion, and tectonic activity create canyons",
    "summary": "A canyon is a deep, narrow valley with steep sides. “Canyon” comes from the Spanish word cañon, which means “tube” or “pipe.” The term “gorge” is often used to mean “canyon,” but a gorge is almost always steeper and narrower than a canyon.",
    "category": "travel",
    "date": "21 August 2021",
    "contents": [
      {
        "type": "pg",
        "content": "Canyons are like silent journals of an area’s history over thousands or even millions of years. By studying the exposed layers of rock in a canyon wall, experts can learn about how the climate changed, what kind of organisms were alive at certain times, and perhaps even how the canyon may change in the future."
      },
      {
        "type": "pg",
        "content": "For example, geologists studying layers of rock in the Columbia River Gorge, in the U.S. states of Washington and Oregon, discovered that the oldest rocks there are at least 17 million years old. They also found out the rocks are dark-black basalt, made from hardened lava. From this, geologists determined that the rocks formed when volcanoes erupted and their lava spilled out onto the land. Over millions of years, the Columbia River and Ice Age glaciers cut through the area and exposed its volcanic beginnings."
      },
      {
        "type": "pg",
        "content": "Canyons are also important to paleontology, or the study of fossils. Fossils are often best preserved in dry, hot areas. Since canyons usually form under the same conditions, they are good places to examine fossils."
      },
      {
        "type": "ig",
        "url": "https://cdn.pixabay.com/photo/2016/11/29/02/23/cliffs-1866832_960_720.jpg"
      },
      {
        "type": "pg",
        "content": "The layers of sediment revealed by a canyon can make it easier to date fossils. For example, a new area of dinosaur tracks was discovered in the U.S. state of Utah at Glen Canyon National Recreation Area in 2009. These tracks reveal new information about a group of dinosaurs called ornithopods. Paleontologists analyzed the layers of rock surrounding the fossils to estimate how old they were. These new dinosaur tracks show that ornithopods were alive 20 million years earlier than scientists thought."
      },
      {
        "type": "pg",
        "content": "Geologists study canyons to determine how the landscape will change in the future. The erosion patterns and thickness of different layers can reveal the climate during different years. A series of very dry years will have very thin layers of rock, when little erosion took place. The overall pattern of erosion and layering reveals the rate of water flow, from both the river and rain, through a canyon."
      },
      {
        "type": "pg",
        "content": "Geologists estimate that the Grand Canyon, for example, is being eroded at a rate of 0.3 meters (1 foot) every 200 years. The Colorado Plateau, the geologic area where the Grand Canyon is located, is a very stable area. Geologists expect the Grand Canyon to continue to deepen as long as the Colorado River flows."
      }
    ],
    "time": "6",
    "badges": ["travel", "canyon", "mountain", "gallery"],
    "likes": "1579",
    "author": "sn1637324823541"
  },
  {
    "id": "tv1611167400000",
    "url": "https://cdn.pixabay.com/photo/2018/05/04/07/55/snow-3373432_960_720.jpg",
    "title": "A Winter wonderland",
    "gist": "Winters mean freezing breeze and chills in most parts of the world, but there are some places which take a snowy avatar and turn into miles of visual delight",
    "summary": "Jokul is an Icelandic word that refers to a mountain always covered in snow and ice. The OED says the word comes from the Icelandic jökull, “icicle.” The English icicle is related. onding.",
    "category": "travel",
    "date": "21 January 2021",
    "contents": [
      {
        "type": "pg",
        "content": "We tend to associate winter with bleak, gray skies and runny noses, but there's a beautiful side to the season that often gets overlooked. We're talking about Italian mountains covered with snow, pristine frozen lakes, and English cottages that put Norman Rockwell paintings to shame. And while we encourage exploring these destinations any time of the year, we won't judge if you want to walk through some winter wonderlands from behind your (warm) computer screen. So grab a mug of hot chocolate and forget about summer for a little while."
      },
      {
        "type": "pg",
        "content": "Here are top two winter wonderlans around the world"
      },
      {
        "type": "hd",
        "content": "Banff National Park, Canada"
      },
      {
        "type": "pg",
        "content": "Easily one of the most beautiful winter wonderlands in Canada, Banff National Park overwhelms with views of the Canadian Rockies and regular cast of wildlife. The park's star attraction is glacial Lake Louise, which looks even more spectacular once it freezes over."
      },
      {
        "type": "ig",
        "url": "https://media.cntraveler.com/photos/5c1bf713a546ef283d2173ea/master/w_1920%2Cc_limit/Banff-National-Park_Canada_GettyImages-727140619.jpg"
      },
      {
        "type": "hd",
        "content": "Antarctica"
      },
      {
        "type": "pg",
        "content": "There are few places (if any) more stunning than the world's southernmost continent. Although 99 percent of Antarctica is covered with ice, the landscape still manages to be amazingly diverse—surreal blue glaciers, active volcanoes, the rough waterways of the Drake Passage, and 360-degree views of untouched snow. And those views are made even better when an emperor penguin or humpback whale makes an appearance."
      },
      {
        "type": "ig",
        "url": "https://media.cntraveler.com/photos/5e066b84182d5300085dd723/master/w_1920%2Cc_limit/Antarctica-winter-wonderlands-GettyImages-156709702.jpg"
      },
      {
        "type": "hd",
        "content": "Bryce Canyon National Park, Utah"
      },
      {
        "type": "pg",
        "content": "Bryce Canyon National Park welcomes most of its visitors from spring to fall, but those travelers are seriously missing out. Skirt the crowds and visit during the winter, when you can participate in ranger-led snowshoe hikes and winter astronomy programs. Plus, you'll get to see those famous hoodoos in their best environment—peeking through a blanket of snow."
      },
      {
        "type": "ig",
        "url": "https://media.cntraveler.com/photos/5e066b91d760ba0008eaf867/master/w_1920%2Cc_limit/Bryce-Canyon-winter-wonderlands-GettyImages-1158015759.jpg"
      },
      { "type": "pg", "content": "" }
    ],
    "time": "5",
    "badges": ["snow", "winter", "mountain", "travel", "gallery"],
    "likes": "1235",
    "author": "sn1637324823541"
  },
  {
    "id": "tv1608748200000",
    "url": "https://cdn.pixabay.com/photo/2015/12/29/14/51/mountains-1112911_960_720.jpg",
    "title": "The Sound cloud You loved is doomed",
    "gist": "These geological formations are created by running rivers and shifting glaciers.",
    "summary": "Valleys are depressed areas of land–scoured and washed out by the conspiring forces of gravity, water, and ice. Some hang; others are hollow. They all take the form of a 'U' or 'V.'",
    "category": "travel",
    "date": "24 December 2020",
    "contents": [
      {
        "type": "pg",
        "content": "Rivers and streams make most primary valley cuts, carving steep-walled sides and a narrow floor that from afar looks like the letter 'V.' The gradient of the river—how quickly it drops—helps define the steepness of the sides and the width of the floor. Mountain valleys, for example, tend to have near-vertical walls and a narrow channel, but out on the plains, the slopes are shallow and the channel is wide."
      },
      {
        "type": "pg",
        "content": "As waters wind toward the sea, they add to natural twists in the land by stripping sediment from the outsides of bends and dumping it on the insides. The bulk of the rock and dirt is dredged from the bottom of the channel, a process called down cutting that can ultimately lead to deep, slender chasms like Black Canyon in Colorado's Gunnison National Park."
      },
      {
        "type": "ig",
        "url": "https://cdn.pixabay.com/photo/2016/11/21/17/02/adventure-1846482__340.jpg"
      },
      {
        "type": "pg",
        "content": "The massive blocks of snow and ice slowly creep downhill where they will meet the least resistance: valleys already cut by rivers and streams. As the glaciers ooze, they pick up rocks and grind away at the valley floor and sides, pressing the 'V' into a 'U.' When the glacier melts, a U-shaped valley marks the spot where the snow and ice once flowed."
      },
      {
        "type": "pg",
        "content": "Side valleys are formed by tributaries to streams and rivers and feed the main stem. Where the main channel is carved deeper than the tributary, as commonly occurs during glaciations, the side valleys are left hanging. Waterfalls often cascade from the outlet of the upper valley into the drainage below."
      }
    ],
    "time": "3",
    "badges": ["mountain", "travel", "valley", "gallery"],
    "likes": "1106",
    "author": "sn1637324823541"
  },
  {
    "id": "tv1630780200000",
    "url": "https://cdn.pixabay.com/photo/2019/11/12/13/38/wanderer-4621118_960_720.jpg",
    "title": "The Wanderer",
    "gist": "The joy of discovery is the single most important thing in life. Don’t forget it.",
    "summary": "As you move outside of your comfort zone, what was once the unknown and frightening becomes your new normal.",
    "category": "travel",
    "date": "5 September 2021",
    "contents": [
      {
        "type": "pg",
        "content": "I have never in my life claimed to be an adventurer or outdoors lover – until I started hiking in the mountains. With the lovely, lush green forests and foothills, the tantalizing teal lakes hidden away like a secret prize waiting to be found, and those stunning sky-high jagged peaks, it was love at first sight. But more than that, hiking in the mountains became an immediate passion because of the way it made me feel. I was able to just be the real me and connect with the version of myself that felt the most authentic and true."
      },
      {
        "type": "pg",
        "content": "Being surrounded by the mountains has a powerful effect on something deeper. It’s as if being amidst something greater than ourselves, changes our perspective and insight on life and the things that really matter. Somehow without trying, you are able to confront your demons, re-evaluate your problems or your goals or your desires – you are able to widen your perspective and reflect on ‘the big picture’."
      },
      {
        "type": "ig",
        "url": "https://cdn.pixabay.com/photo/2021/07/03/21/22/mountains-6384895_960_720.jpg"
      },
      {
        "type": "pg",
        "content": "Call me crazy or cliche or what ever..but there is no denying it. Maybe it’s that dose of fresh mountain air, the exercise or the litres of water I drink when I’m hiking, but I swear to you that after a visit to the mountains I feel enormously better. It’s as if there is an energy source in those summits that you can tap into and feed off of. Getting out there literally fuels you and rebalances you; you will notably feel more calm and happy, and less irritable or anxious. There was never a time that I left the mountains without feeling refreshed, happy and inspired – ready to take on anything that came my way."
      },
      {
        "type": "ig",
        "url": "https://cdn.pixabay.com/photo/2021/04/05/18/19/hiking-6154252_960_720.jpg"
      },
      {
        "type": "pg",
        "content": "Through challenging yourself, both physically and mentally, you grow. Through pushing yourself outside of your comfort zone and getting out there, you flourish. Through completing something you started and seeing it through to the end, you make progress. Through getting lost or falling down or failing to summit a climb, you learn to not only be kind to yourself knowing you TRIED your best, but you blossom into a more humble person! Through interacting with nature and wildlife, you develop respect for the earth and empathy for the wellbeing of the environment and of the animals."
      }
    ],
    "time": "4",
    "badges": ["mountain", "travel", "gallery", "adventure"],
    "likes": "968",
    "author": "sn1637324823541"
  },
  {
    "id": "tv1581445800000",
    "url": "https://5.imimg.com/data5/BO/LE/MY-49816442/sandakphu-phalut-trek-500x500.jpg",
    "title": "Trekkies Wonderland - Sandakphu",
    "gist": "If you are a trekking enthusiast, you cannot simply miss out on the Sandakphu Trek for sure.",
    "summary": "The mesmerizing Sandakphu Trek is located in Darjeeling at the West Bengal-Nepal border. Boasting a height of 3665 m, the cliff is located at the Ilam district of Nepal. The trail is quite easy to traverse. So beginners can choose to trek through Sandakphu without any fear.",
    "category": "travel",
    "date": "12 February 2020",
    "contents": [
      {
        "type": "pg",
        "content": "Reaching this place is quite an easy thing. Also, it depends on the place where you start it. You can take a flight or a train to reach the main city of Darjeeling. If you prefer flight transport, you can book your tickets and reach Bagdogra Airport. Once you reach, hire a taxi or book a train to reach New Jalpaiguri."
      },
      {
        "type": "pg",
        "content": "Day 1 : On your first day, you will reach New Jalpaiguri by train or by road. Post your arrival, you will be taken to the starting point of the trek, Manebhanjan. It is a quick 4-hour ride from New Jalpaiguri to Manebhanjan."
      },
      {
        "type": "ig",
        "url": "https://pickyourtrail.com/blog/wp-content/uploads/2020/08/photo-1545652985-5edd365b12eb.jpg"
      },
      {
        "type": "pg",
        "content": "Day 2 : The actual trekking expedition starts on the second day. Your day kick starts with a walk to cover 11 km. On your way, you will visit places like Tumling, which is one of the most beautiful places in the Singalila Range. This is a beautiful 9500 ft peak where you can also relish a tongue-tingling breakfast."
      },
      {
        "type": "pg",
        "content": "Day 3 : On the third day of your memorable trekking journey, you will cover 9 km by walk which will take around 5 hours to finish. After successful completion of this 9 km trek, you will reach Singalila National Park and Kalipokhri. Also, do not miss taking amazing pictures of the natural scenery while walking through this park. Stay at this beautiful spot for one night and resume your journey the next morning."
      },
      {
        "type": "ig",
        "url": "https://northbengaltourism.com/images/offbeat/sandakphu_780.jpg"
      },
      {
        "type": "pg",
        "content": "Day 4 : On your penultimate day, you will cover a distance of 8km. Once you finish this walk, you will step into heaven. How excited are you to witness Sandakphu Peak, Mt Khangchendzonga, Mt Everest from one point? This will truly be an eye-opening moment of your entire life. Enjoy the moment for you will never get to experience such an amazing view anywhere else."
      },
      {
        "type": "pg",
        "content": "Day 5 : Now, it’s time to say goodbye to the beautiful Sandakphu trek and your fellow mates. While returning, you can visit places like Srikhola and Gurdum if you have enough time. Once you reach Srikhola, hit the road to reach New Jalpaiguri and get back to home."
      },
      {
        "type": "ig",
        "url": "https://www.nomadicweekends.com/wp-content/uploads/2019/02/dsc_1066_Main_800.jpg"
      },
      {
        "type": "pg",
        "content": "Leaving the place will probably be the hardest part of your entire trekking experience. Also, It is believed that nature teaches you a lot more than what you learn in schools. Listen to the music of hummingbirds and gushing water bodies. If you are a nature lover, do not miss out on the Sandakphu Trek."
      }
    ],
    "time": "10",
    "badges": ["mountain", "trek", "adventure", "travel"],
    "likes": "2350",
    "author": "sn1637324823541"
  },
  {
    "id": "tv1584210600000",
    "url": "https://www.tripexperienceblog.com/wp-content/uploads/2018/04/hampta-trek-1.jpg",
    "title": "Hampta Pass - A Dramatic Crossover",
    "gist": "Standing on the top of the pass, what’s ahead and behind are two different worlds. It changes in a matter of minutes.",
    "summary": "At 14,000 feet Hampta Pass in Himachal Pradesh falls under those rare, dramatic pass crossings in the Himalayas. On one side is the lush green valley of Kullu — with forests, grasslands, and flowers blooming on the side of your trail. On the other is the almost arid, stark landscape of Lahaul, with barren mountains and almost no vegetation.",
    "category": "travel",
    "date": "15 March 2020",
    "contents": [
      {
        "type": "pg",
        "content": "Simply put, the Hampta Pass is Himachal’s Valley of Flowers. The landscape is strikingly similar to that of Valley of Flowers – a green narrow valley protected by snow-covered mountains – but there’s an added bonus here."
      },
      {
        "type": "pg",
        "content": "When you get onto the other side of the Hampta Pass, you’ll be in awe looking at the stark contrast from what you just left behind. The landscape that stretches in front of you is Spiti Valley, known for its barren stretches, rugged terrain and forget-me-not blue skies."
      },
      {
        "type": "ig",
        "url": "https://togedr.com/blog/wp-content/uploads/2019/04/Chandratal-1024x683.jpg"
      },
      {
        "type": "pg",
        "content": "What makes the dramatic changes heightened, even more, is how thrilling the climb to Hampta Pass is. For trekkers, crossing the Hampta Pass (even without the scenery changes) is a great story of adventure. They will love the nervous excitement of climbing to the pass over many ledges, almost appearing to get to the pass, but never really sure until you get there"
      },
      {
        "type": "pg",
        "content": "On this trek, you move from one side to the other over a period of 6 days, covering 25 km."
      }
    ],
    "time": "5",
    "badges": ["mountain", "travel", "trek", "adventure"],
    "likes": "3560",
    "author": "sn1637324823541"
  },
  {
    "id": "tv1589653800000",
    "url": "https://static2.tripoto.com/media/filter/tst/img/186426/TripDocument/1574248968_sham_valley_4_e1560239064414.jpg",
    "title": "Zanskar Valley | The dramatic vista",
    "gist": "It is a unique blend of time-honoured Tibetan culture and modern-day practices. ",
    "summary": "It is a town of sharp contrasts as it is an ideal destination for high spirit travellers, nature lovers, adventure seekers and a spot for a kicked-back vacation. The air is wonderfully clean and the unspoilt landscapes make the land remain ripe for cherished adventures and exploration",
    "category": "travel",
    "date": "17 May 2020",
    "contents": [
      {
        "type": "pg",
        "content": "The summer month from April to Mid September proves to be the best time to visit the Zanskar valley. The brutally cold winters in these months are replaced by midnight sun in the summers. The climate is most energizing at this time and also obliging as the snow would have softened. In these months, there is a buzz of movement with tourists flying in for sightseeing and to be a part of the festivities in the valley. The average temperature ranges between a minimum of 10° C to a maximum of 20° C. This also states that the summers here are cool and pleasant unlike the scorching heat experienced by the rest of the country."
      },
      {
        "type": "pg",
        "content": "Chadar Trek, Also known as the frozen river trek, this experience is one of its kinds in the world. If you are visiting the valley in the winter months then embarking on this trek is a must. The trail takes you to an elevation of 10,000 to 11,000 feet and you must be healthy and fit if you wish to indulge in this adventure activity"
      },
      {
        "type": "ig",
        "url": "http://cdn.cnn.com/cnnnext/dam/assets/150910142728-chadar-trek-rapids.jpg"
      },
      {
        "type": "pg",
        "content": "Pensi La Pass, Rich with blue-green water springs, medicinal plants and an unparalleled view of the surrounding mountains, the pass creates a lovely sight for visitors. It is accessible only in the months of May to September and observes heavy snowfall during the rest of the months. You will be able to spot rare wildlife as well."
      },
      {
        "type": "ig",
        "url": "https://www.ekashmirtourism.com/blog/wp-content/uploads/2020/04/pensi-la-pass.jpg"
      },
      {
        "type": "pg",
        "content": "Rangdum, an elliptically shaped plateau that is situated at an elevation of 3657 metres. You can take a day out of your itinerary to visit this place. Colourful hills and dazzling white glaciers flank it. The region is a charming site and you will also be able to see the only accessible glacier to people- the Drang-drung glacier from this region."
      },
      {
        "type": "ig",
        "url": "https://www.ekashmirtourism.com/blog/wp-content/uploads/2020/04/rangdum-monastery.jpg"
      },
      {
        "type": "pg",
        "content": "Contrary to Zanskar and its rugged landscapes, the Suru valley will enchant you will full bloom and lush greenery. It is most visited by adventure enthusiasts as it is the starting point for rafting trips and other mountain expeditions. The tourism activity is very limited here and you can hence make most of your trip by avoiding the crowd."
      }
    ],
    "time": "9",
    "badges": ["mountain", "travel", "valley"],
    "likes": "1265",
    "author": "sn1637324823541"
  },
  {
    "id": "tc1548613800000",
    "url": "https://miro.medium.com/max/1400/1*1Z177dpTeAp7uEFc5Zx2xg.png",
    "title": "Animate a React app using CSS Method",
    "gist": "Animation in ReactJs app is a popular topic and there are many ways to create different types of animations",
    "summary": "Many developers create animation exclusively using css and adding classes to HTML tags. This is a great way and you should use it. If you want to create complex animations you can pay attention to GreenSock. GreenSock is the most powerful animation platform. There are also a lot of libraries, components for creating animation in React.",
    "category": "technology",
    "date": "28 January 2019",
    "contents": [
      {
        "type": "pg",
        "content": "Animation in ReactJs app is a popular topic and there are many ways to create different types of animations.Many developers create animation exclusively using css and adding classes to HTML tags. This is a great way and you should use it. If you want to create complex animations you can pay attention to GreenSock. GreenSock is the most powerful animation platform. There are also a lot of libraries, components for creating animation in React.Let’s talk about them"
      },
      { "type": "hd", "content": "CSS method" },
      {
        "type": "pg",
        "content": "This method is one of the best for a simple animation. When you use it instead of importing javascript libraries, your bundle remains small. And browser spends fewer resources. These two points also largely impact app productivity. If you have a simple animation and worry about the size of your bundle pay attention to this method."
      },
      {
        "type": "ig",
        "url": "https://miro.medium.com/max/2400/1*08y12Sp1d9cLSKE9nz1EaA.png"
      },
      { "type": "pg", "content": "And css styles:" },
      {
        "type": "ig",
        "url": "https://miro.medium.com/max/700/1*nZ6Mq1wmqu8JSF-DfebeVw.png"
      },
      {
        "type": "pg",
        "content": "Believe me, it’s necessary to use this method in most situations. We are better off writing several css lines and triggering the className than importing big libraries and implementing it in your projects. The users will be grateful to you that your browser reproduces app quickly."
      }
    ],
    "time": "8",
    "badges": ["technology", "react", "javascript"],
    "likes": "279",
    "author": "sn1637324823541"
  },
  {
    "id": "tc1608143400000",
    "url": "https://s3.amazonaws.com/a.storyblok.com/f/86602/1024x683/034394d990/react-widget.jpg",
    "title": "Iframes with React",
    "gist": "Learn how to use Iframes with React following the best practices for Security and Performance",
    "summary": "Today it’s challenging to find standalone web apps. We can find most of these apps work with each other where the integrations happen either from the frontend or backend. When looking at these integrations, one of the oldest yet simple integration strategy is using Iframes.",
    "category": "technology",
    "date": "17 December 2020",
    "contents": [
      {
        "type": "pg",
        "content": "Though it’s easy to embed an Iframe into your React app, making it secure, fast, and reliable requires specific expertise. Therefore, it’s essential to understand the best practices around using Iframes with React."
      },
      { "type": "hd", "content": "Can We Add Any URL to SRC Attribute?" },
      {
        "type": "pg",
        "content": "As an experiment, I’ve used YouTube to embed a video into a React app. When I copy-paste a YouTube video link directly into the Iframe, it threw an error saying “www.youtube.com refused to connect.” To embed a YouTube video to an Iframe, I had to use their embed URLs."
      },
      { "type": "hd", "content": "Verify the X-Frame-Options" },
      {
        "type": "pg",
        "content": "Suppose you closely observe the error in Chrome Dev Tools. In that case, you can find that YouTube prevents the loading of their direct URLs (Not the embeddable one) by using X-Frame-Options set to “same-origin” returning in the HTTP Header from YouTube servers."
      },
      {
        "type": "ig",
        "url": "https://miro.medium.com/max/555/1*eA-DK3p3sOOLNw9au6RmNA.png"
      },
      {
        "type": "pg",
        "content": "Therefore, we must embed only URLs that are advertised as embeddable. Otherwise, even if it works initially (Unlike the case of YouTube), these could get blocked without your knowledge using X-Frame-Options."
      },
      {
        "type": "pg",
        "content": "And I hope it’s clear that adding any URL into an Iframe doesn’t work with React or any other frontend library or framework unless the embedding site allows your web app domain to embed it."
      }
    ],
    "time": "8",
    "badges": ["technology", "react", "iframe", "javascript"],
    "likes": "156",
    "author": "sn1637324823541"
  },
  {
    "id": "tc1603737000000",
    "url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR3izWC18O9auxsfDiWXYSr6jK2HGN0ilI4mA&usqp=CAU",
    "title": "How to Install React.js with create-react-app",
    "gist": "How to install and run a React application the easy way.",
    "summary": "As a Frontend Developer, I have personally worked with React in my projects and probably will continue to work with it in the future. One of the steps that many people struggle with is the installation/configuration process of React.",
    "category": "technology",
    "date": "27 October 2020",
    "contents": [
      {
        "type": "pg",
        "content": "As a Frontend Developer, I have personally worked with React in my projects and probably will continue to work with it in the future. One of the steps that many people struggle with is the installation/configuration process of React."
      },
      {
        "type": "pg",
        "content": "So let's start with the basics. In this post, you are going to learn how to install and run a React application the easy way."
      },
      {
        "type": "pg",
        "content": "First of all, you are going to need NPM (or Yarn, alternatively). So download and install it first."
      },
      { "type": "hd", "content": "What is create-react-app?" },
      {
        "type": "pg",
        "content": "Since it is complicated and takes a lot of time, we don't want to configure React manually. create-react-app is a much easier way which does all the configuration and necessary package installations for us automatically and starts a new React app locally, ready for development."
      },
      {
        "type": "pg",
        "content": "Another advantage of using create-react-app is that you don't have to deal with Babel or Webpack configurations. All of the necessary configurations will be made by create-react-app for you."
      },
      {
        "type": "pg",
        "content": "According to the React documentation, create-react-app is one of the officially supported ways to create single-page applications in React."
      },
      { "type": "hd", "content": "How to Install Create-React-App" },
      {
        "type": "pg",
        "content": "In order to install your app, first go to your workspace (desktop or a folder) and run the following command:"
      },
      {
        "type": "ig",
        "url": "https://cdn.jsdelivr.net/gh/facebook/create-react-app@27b42ac7efa018f2541153ab30d63180f5fa39e0/screencast.svg"
      },
      {
        "type": "pg",
        "content": "The installation process may take a few minutes. After it is done, you should see a folder that appears in your workspace with the name you gave to your app."
      },
      {
        "type": "pg",
        "content": "After the installation is completed, change to the directory where your app was installed:"
      },
      {
        "type": "pg",
        "content": "and finally run npm start to see your app live on localhost:"
      }
    ],
    "time": "9",
    "badges": ["technology", "react", "javascript"],
    "likes": "985",
    "author": "sn1637324823541"
  },
  {
    "id": "tc1541615400000",
    "url": "https://miro.medium.com/max/2000/1*41wlERdzz-n7jG_C3ZDesQ.jpeg",
    "title": "What is Babel?",
    "gist": "Babel is a JavaScript transpiler",
    "summary": "Babel is a JavaScript transpiler that converts edge JavaScript(ES6) into plain old ES5 JavaScript that can run in any browser even in the old ones.",
    "category": "technology",
    "date": "8 November 2018",
    "contents": [
      {
        "type": "pg",
        "content": "Hello guys, Today I’m going to talk about “Babel” which is one of the hottest topics in the front-end-dev playground. Babel is a JavaScript transpiler that converts edge JavaScript(ES6) into plain old ES5 JavaScript that can run in any browser even in the old ones."
      },
      { "type": "hd", "content": "What is a transpiler?" },
      {
        "type": "pg",
        "content": "Transpilers, or source-to-source compilers, are tools that read source code written in one programming language, and produce the equivalent code in another language which is in the same level."
      },
      { "type": "hd", "content": "What is transpiling then?" },
      {
        "type": "pg",
        "content": "It is a process of taking one language & convert it in to another like you transpile your typescript into javascript and sass into css."
      },
      {
        "type": "hd",
        "content": "What is the difference between compiling & transpiling?"
      },
      {
        "type": "pg",
        "content": "Compiling convert one language to another at lower abstraction level like java to byte code while transpiling convert one language to another at same abstraction level like typescript to javascript or sass to css."
      },
      { "type": "hd", "content": "What is the reason for using babel?" },
      {
        "type": "pg",
        "content": "Well, all the latest javascript features are not supported in every browser yet. So someone needs to do the converting part right? So babel is here to transpile latest javascript features(ES6 features) which are not understandable to every browser to ES5 which is understandable to every browser."
      }
    ],
    "time": "4",
    "badges": ["technology", "javascript", "es6"],
    "likes": "206",
    "author": "sn1637324823541"
  },
  {
    "id": "tc1637173800000",
    "url": "https://www.adhocsoftwares.com/wp-content/uploads/2021/02/Angular-Js-Vs-React-Js.jpg",
    "title": "Angular vs React",
    "gist": "Compare Angular vs React to over performance, maintainability, learning curve, and use cases to find out which one suits your needs better.",
    "summary": "Choosing the right javascript frameworks is a real confusion. Especially when you have a lot of options that are super resourceful and capable of facilitating the project requirements. But choosing the one for the right set of projects demands knowledge of several critical aspects. We have covered some of the essential points in this post by making a fair comparison of Angular vs React.",
    "category": "technology",
    "date": "18 November 2021",
    "contents": [
      {
        "type": "pg",
        "content": "Selecting between the two frontend platforms like Angular vs React for the projects is a matter of debate. The reason why we call it a debate is because we want to minimize the confusion. Having said that, a good number of our clients ask us to suggest the best frontend framework. In case, you’re wondering the same, connect with our web development experts to discuss your project dimensions."
      },
      {
        "type": "pg",
        "content": "However, we cannot define best, but we can surely analyze which is better in which situations. In this blog, we are going to discuss the two most loved frontend frameworks. So, Angular or React? Let’s check it out."
      },
      { "type": "hd", "content": "What is Angular?" },
      {
        "type": "pg",
        "content": "Angular is a development platform built on the typescript. It is a component-based framework for building scalable web apps. It has a collection of well-integrated libraries and features such as client-server communication, routing, and more. It has a suite of developer tools to develop and scale projects from single-developer size to enterprise-grade applications. Moreover, it’s constantly updated technology with its latest developments led by the Angular team at Google."
      },
      { "type": "hd", "content": "What is React?" },
      {
        "type": "pg",
        "content": "React is an open-source JavaScript library used for frontend development. It is used for building user interface or UI components. Its component-based and declarative traits let developers create interactive and complex UIs easily. Developers can build fast and scalable apps for all platforms due to its “learn once write anywhere” principle. React is managed by Facebook and a community of individual developers and communities."
      },
      { "type": "hd", "content": "Angular vs React Comparison" },
      {
        "type": "pg",
        "content": "Angular is a Javascript framework built using Typescript, while Reactjs is a Javascript library and built using JSX. Angular is mostly used to build complex enterprise-grade apps like single-page apps and progressive web apps, while React is used to build UI components in any app with frequently variable data. Angular’s learning curve is steeper due to its too many in-built functionalities while React’s smaller package size."
      }
    ],
    "time": "7",
    "badges": ["technology", "react", "javascript", "angular"],
    "likes": "382",
    "author": "sn1637324823541"
  },
  {
    "id": "fd1596997800000",
    "url": "https://1.bp.blogspot.com/-yVvD-Owz_yQ/X98CHoO3L5I/AAAAAAAAEnA/R2kD73T3_UQdQzv7kOmNABnMysRtC-o1ACLcBGAsYHQ/s2048/authentic%2Bbengali%2Bfood%2Bin%2Bkolkata%2Bbengali%2Bcuisine.jpg",
    "title": "A GLIMPSE INTO BENGALI CUISINE, LIFESTYLE AND CULTURE",
    "gist": "During our Kolkata food tour, our quest to understand the Bengali way of life a little more closely through its food, cultural anecdotes and references led us to the warm, genial and amusing company of a wonderful Bengali couple who were clearly ardent foodies.",
    "summary": "During our Kolkata food tour, our quest to understand the Bengali way of life a little more closely through its food, cultural anecdotes and references led us to the warm, genial and amusing company of a wonderful Bengali couple who were clearly ardent foodies. Restaurateurs Piyali and Sunando Banerjee, have translated their passion into profession through their culinary venture named Hanglaatherium. ",
    "category": "food",
    "date": "10 August 2020",
    "contents": [
      {
        "type": "pg",
        "content": "During our Kolkata food tour, our quest to understand the Bengali way of life a little more closely through its food, cultural anecdotes and references led us to the warm, genial and amusing company of a wonderful Bengali couple who were clearly ardent foodies. Restaurateurs Piyali and Sunando Banerjee, have translated their passion into profession through their culinary venture named Hanglaatherium. So brace yourselves for some amazing insights, great company, endearing interaction and of course some delicious food. The agenda for the day was to visit to a local market to learn about the Bengali cuisine essentials and to try a usual Bengali meal. Hence we started with a visit to the Gariahat fish and vegetable market. It is one of the city’s oldest and biggest market. Fish is the star element of the rich and vibrant Bengali cuisine. It is an indispensable part of the daily meal and such is the craze that more than one preparation graces the average Bengali lunch platter. Their cogent love for fish gets reflected in the busy and the chaotic scene at a fish market where their enthusiasm peaks as they select the best catch for the day. As we stepped inside the walled precincts of the Gariahat Fish market with our host Piyali, a regular visitor to this place, we were thrilled by the sight and smell of the mind boggling variety of live fishes. Piyali walked us through the common spices that preferred for daily cooking. There were Rui, Katla, Pomfret, Bhetki, Tryangra, Illish, Magur and many more. Piyali’s deep knowledge about the nitty gritties of the cuisine and her enthusiasm to acquaint us with the same made us fall in love with the experience. As we made our way through the sea of fishes, we got enlightened about their uses and benefits. Apart from getting familiar with the identities of the fishes, we also came to know about some socio cultural contexts involving these fishes. For example we learnt how the rui or katla fish is a mean of cementing the ties between the bride and the grooms family. In due course of the conversation we also came to know about the two categories of Bengalis, i.e the Ghotis and the Bangals, their prolonged underlying rivalry that has spilled even onto the football fields and their different culinary preferences in spite of having the common ingredients landscape being the same."
      },
      {
        "type": "ig",
        "url": "https://somethingiscooking.com/wp-content/uploads/2017/01/BengaliFishCurry2.jpg"
      },
      {
        "type": "pg",
        "content": "From fish section we went to the vegetable section to learn about the favourite picks of the people of Bengal. We came to know that the Bengalis are equally fond of vegetables and the cuisine has iconic range of vegetarian delicacies too. Piyali showed us some of the usual fares like Pumpkin, it’s flower, plantain stem and blossom and some of the unusual yet coveted fares like maan kochu, different kinds of leafy greens vegetables etc. After that insightful market visit it was time to head to her home to taste a basic breakfast fare of luchi, sada aloor tarkari, begun bhaja and rosogolla. But before that Piyali’s spouse Sunando took us to a nearby crowded eatery selling an interesting thing called Patai Porota. As the name suggested, it was a flatbread that had borne the brunt of ruthless palm beating. The resultant fluffy and flaky mass is eaten with yellow pea curry or some sweet stuff. It was tasty but not outstanding. On reaching their home we were joined by one of their close friends Avijit dada. All the walking had made us quite hungry. Piyali quickly whipped up the sada aloor tarkari using just three to four ingredients. Sunando fried the luchi and soon the table was set for the meal and a hearty conversation. The subtle and soulful meal was accompanied by an amusing conversation about some of the quintessential traits and idiosyncrasies of the Bengali people. So there were the references to Borolin antiseptic cream, Dim paruti, Sunlight detergent bar, Horlicks health drinks. We are so grateful for this endearing encounter full of food and cultural connotations."
      }
    ],
    "time": "5",
    "badges": ["food", "bengali", "cuisine"],
    "likes": "653",
    "author": "sn1637324823541"
  },
  {
    "id": "fd1597602600000",
    "url": "https://i.pinimg.com/originals/ab/70/e2/ab70e2c136c7b03329ea8c814fc4b3e7.jpg",
    "title": "KOLKATA EATING EXPERIENCE",
    "gist": "Pice Hotel, Golbari Kosha Mangsho, Ladykeni etc",
    "summary": "This post is brings you a medley of popular traditional Bengali delicacies from some of the renowned and legendary eateries across the city of Kolkata. In this expedition, we were accompanied by our young and gracious host Pamela Das who guided us with useful insights and snippets regarding the same.",
    "category": "food",
    "date": "17 August 2020",
    "contents": [
      {
        "type": "pg",
        "content": "This post is brings you a medley of popular traditional Bengali delicacies from some of the renowned and legendary eateries across the city of Kolkata. In this expedition, we were accompanied by our young and gracious host Pamela Das who guided us with useful insights and snippets regarding the same."
      },
      {
        "type": "pg",
        "content": "We started the food tour from a very special place called Suruchi self help restaurant. It’s the city’s oldest Bengali restaurant and is completely owned and operated by women. These women are a league of brave hearts who have battled grave adversities and have emerged strong and resilient. They are the inmates of shelters run by All Bengal Women’s Union, an NGO that works with disadvantaged women and girls. Due to their diligence and skill, Suruchi has earned a name among the masses with its easy on the pocket, home style food. Here we tried a basic combination of steamed rice with dimer jhol (egg curry) followed by a couple of pithe (rice flour based desserts) with payesh (rice and milk pudding). Though the egg curry was thin, light on palette yet it was extremely delicious. Among the desserts we loved the cardamom flavoured patishapthas."
      },
      {
        "type": "ig",
        "url": "https://i1.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/08/DSC02302.jpg?resize=300%2C200"
      },
      {
        "type": "pg",
        "content": "Meeting the resilient womenfolk in the kitchen and hearing about their stories of struggle and success was a inspiring experience. From there we went on to try a massive Bengali spread at the iconic pice hotels named Swadhin Bharat Hindu Hotel whose origin dates back to the British rule. Situated near the College street, this place was frequented by legends and stalwarts from different fields. Pice hotels are humble eateries that serve traditional Bengali cuisine at affordable rates. They have a pretty extensive lineup of traditional fish based Bengali dishes. We ordered 11 items including rice, dal, fish curries and chutneys. The food was fresh and delicious. We loved eating it from the banana leaves. The service was prompt and satisfactory. The crowd over here included traders, office goers and shoppers."
      },
      {
        "type": "ig",
        "url": "https://i0.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/08/DSC02309-2.jpg?resize=300%2C200"
      },
      {
        "type": "pg",
        "content": "After that heavy scrumptious meal we headed to have some classic sweets from the legendary Bhim Chandra Nag which is believed to be the birthplace of the popular Bengali sweet called Ladikeni. It is a syrup laden deep fried sweet made of chenna or native cottage cheese. As per the legends this sweets was created as a tribute to the  lovely and charming Lady Canning who was the wife of Lord Canning. Along with the ladikeni we also tried sitabhog and misti doi. Sitabhog is like a sweetened rice flour based vermicelli while misti doi is sweetened curd. Everything, especially the ledikeni, was outstanding."
      },
      {
        "type": "pg",
        "content": "After that sweet rush we went to Princep Ghat, which is one of the oldest recreational spots in the city. Watching the magnificent structures like the Vidyasagar Setu and the palladium porch at Princep Ghat over a cup of invigorating lebu cha (lemon tea) and ghoti gorom (savoury snacks) was a comforting experience. We spent some time on the banks of river Hooghly admiring it’s majesty."
      },
      {
        "type": "pg",
        "content": "After that leisurely break we reached our final destination for the day i.e Golbari in Shyambazar. It is one Kolkata’s legendary eateries that has been around for over a century. We were there to try their iconic mutton kosha with porota. The dark brown, slow cooked rich mutton gravy with oil floating on the top was heavenly. It lived up to its reputation though the amount of oil might scare away the health freaks. This journey was a special one for we got to try some of the real flavours of Kolkata."
      }
    ],
    "time": "6",
    "badges": ["food", "bengali", "mutton"],
    "likes": "785",
    "author": "sn1637324823541"
  },
  {
    "id": "fd1599676200000",
    "url": "https://image.scoopwhoop.com/w1200-h667-cfix/https://s4.scoopwhoop.com/anj/s/781746212.png",
    "title": "THE KOLKATA BIRYANI TRAIL",
    "gist": "A close cousin of the Lucknowi Biryani, Kolkata Biryani is loved for its subtle taste and less robust yet toothsome flavours.",
    "summary": "As a potpourri of various traditions and cultural influences, Kolkata’s cuisine is rich, extensive and vibrant. However, that one dish which has never ceased to win the hearts of the food lovers, is the Kolkata Biryani. A close cousin of the Lucknowi Biryani, Kolkata Biryani is loved for its subtle taste and less robust yet toothsome flavours. ",
    "category": "food",
    "date": "10 September 2020",
    "contents": [
      {
        "type": "pg",
        "content": "As a potpourri of various traditions and cultural influences, Kolkata’s cuisine is rich, extensive and vibrant. However, that one dish which has never ceased to win the hearts of the food lovers, is the Kolkata Biryani. A close cousin of the Lucknowi Biryani, Kolkata Biryani is loved for its subtle taste and less robust yet toothsome flavours. "
      },
      {
        "type": "pg",
        "content": "Apart from the long grain fragrant rice, aromatic whole spices, good quality meat, optimum use of seasonings and the dum style of cooking, it’s the huge chunks of fried potatoes that lends a unique dimension to its flavour profile. "
      },
      {
        "type": "pg",
        "content": "The city’s deep seated love for this delicacy is clear through the presence of innumerable biryani joints, both small and big or new and old. With its quintessential characteristics, Kolkata biryani is class apart whose distinguishing feature is the use of potatoes. "
      },
      {
        "type": "pg",
        "content": "Kolkata (or Calcutta) biryani owes its origin to Lucknow. It originated in the kitchen of Nawab Wajid Ali Shah, the last ruler of Awadh when he moved to Kolkata from Lucknow. Every biryani aficionado will agree that the best Kolkata biryani can only be found in the city and nowhere else. Our quest to taste the best biryani in Kolkata led us to the kitchen of the stalwart chef Manzilat Fatima, who belongs to the lineage Nawab Wajid Shah and to an old, popular eatery in the Northern fringe of the city named Dada Boudi Biryani. "
      },
      {
        "type": "pg",
        "content": "Come let’s walk you through the experience. It was a privilege to learn the niceties of this stellar dish from someone who has perceived it in close quarters through handed-down recipes and stories. "
      },
      {
        "type": "pg",
        "content": "Through her popup restaurant that specialises in Awadhi cuisine, Manzilat has been serving happiness to all the food lovers out there. No wonder her chicken and mutton biryani are the talk of the town. Driven by deep passion and love to play with flavours, she and her team serves magic to the discerning customers. Manzilat showed us how to make a classic Kolkata style chicken biryani that anybody can recreate at their home. "
      },
      {
        "type": "pg",
        "content": "Before stepping into the kitchen, we shared a brief conversation over a gorgeous cup of pink chai and some Ulte Tawa Ke Paranthe.  During the tete-tete, she told us about the apocryphal story of how potatoes came to be a part of the Kolkata biryani. It was soon time to start with the cooking. The irresistible, fragrant biryani was ready in just four easy looking steps. But the masterpiece was a result of passion and expertise. It was a joy to see Manzilat play with the ingredients with such effortless ease."
      },
      {
        "type": "ig",
        "url": "https://i0.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/09/DSC02280-3.jpg"
      },
      {
        "type": "pg",
        "content": "The biryani was like a warm cuddle. The subtle and hearty flavours in every morsel sent us into a state of calm bliss. Those yearning for a classic Kolkata biryani must try it at Manzilat’s. The potatoes tasted great as well.  We had paired the biryani with burani raita. The meal at Manzilat ended with a brilliant sooji ka halwa."
      },
      {
        "type": "pg",
        "content": "After trying the classic, Kolkata style chicken biryani from Manzilat, the following day we set out to try it from one of the city’s hugely popular biryani joints named Dada Boudi hotel in Barrackpore. Situated in the Northern part of the city, Barrackpore had gained much relevance during the British Raj, as it formed the administrative and military base then. "
      },
      {
        "type": "pg",
        "content": "We took an electric train ride to reach the historical town of Barrackpore. On alighting from the train we straightaway headed to their biryani factory where the day’s final batch of biryani was going to be prepared. The factory was like a huge room where an army of cooks were busy preparing for the mission. The sight of the large cauldrons, some over the gas stoves and some over the wood fire was absolutely thrilling. Here we met the industrious team of cooks and associates who diligently carried out the task of preparing the biryani. Soon we realised that the whole process from beginning to the end is thoroughly structured and so for us it was like watching one step smoothly transiting into the next and so on. What really impressed us was the sheer dexterity and enthusiasm of the fellows working in tandem. We were amused by the way they were managing the huge fire and the enormous amount of heat emanating from the same without complaining. "
      },
      {
        "type": "ig",
        "url": "https://i2.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/09/DSC02290-2-1.jpg"
      },
      {
        "type": "pg",
        "content": "Soon after the biryani got ready, they were loaded into a goods carrier and dispatched to the hotel. The eatery was crowded to the brim of which half were eating in the seating area and half had queued up for the takeaway. Before digging into our plate, we spoke to Bapi da who told us about the place, it’s speciality and the reason behind it’s unwavering popularity. We couldn’t help but notice the sparkle in his eyes as he spoke about the place. Finally we settled down to eat the famous mutton biryani of Dada Boudi hotel. One morsel of this scrumptious fare just won our heart. The flavours were varied yet subtle. The generous piece of mutton was tender and succulent. The rice was flavourful and fluffy and last but not the least, the potato added a comforting touch to the whole dish. Undoubtedly this was the best we have had in Kolkata. "
      },
      {
        "type": "pg",
        "content": "So this was the story of our Biryani trail in Kolkata. There are many iconic places in the city that serve amazing biryani. We intend to try them on our future visit."
      }
    ],
    "time": "15",
    "badges": ["food", "kolkata", "bengali", "biryani"],
    "likes": "1204",
    "author": "sn1637324823541"
  },
  {
    "id": "fd1582569000000",
    "url": "https://cdn.shopify.com/s/files/1/0077/7918/8836/files/puri.jpg?v=1581590715",
    "title": "PATNA VEG FOOD TOUR",
    "gist": "The historically rich land of Bihar has a diverse cuisine with a plethora of delicacies.",
    "summary": "The historically rich land of Bihar has a diverse cuisine with a plethora of delicacies. The scrumptious and unique Bihari dishes are a treat for foodies hankering for local flavours. Fascinated by the enticing food stories from the state, we decided to explore its vibrant foodscape beyond the most celebrated litti chokha.",
    "category": "food",
    "date": "25 February 2020",
    "contents": [
      {
        "type": "pg",
        "content": "The historically rich land of Bihar has a diverse cuisine with a plethora of delicacies. The scrumptious and unique Bihari dishes are a treat for foodies hankering for local flavours. Fascinated by the enticing food stories from the state, we decided to explore its vibrant foodscape beyond the most celebrated litti chokha. So here we are all ready with an amusing food series that brings you the gastronomic details from different regions of the state. It is not just a journey of taste but an expedition to collate stories – stories that delights, stories that informs and stories that inspires."
      },
      {
        "type": "pg",
        "content": "Today we bring you an fascinating food exploration from the capital city of Bihar. It is a busy city with an amazing heritage and culture and also full of amusing people. So let’s see what the journey holds for us. We are so glad to have been joined by Mayank who is a young and passionate food blogger from the city. "
      },
      {
        "type": "ig",
        "url": "https://i0.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/09/IMG-20200513-WA0003.jpg"
      },
      {
        "type": "pg",
        "content": "We began our journey quite early in the morning from the vicinity near the Patna station as we wanted to start with some amazing local breakfast. Before heading to the most crowded eatery in the area we went to the very famous Mahavir Mandir to pay our reverence to Lord Hanuman. We partook some prasad and set out for Bhola ji’s nashte ki dukaan. It was an insanely crowded place stuffed with people jostling to catch a quick breakfast. The affordable breakfast thali available here consisted of fresh hot puris, jalebi, potato and chana sabzi, dahi vada and raita. Just for 30 rupees the quantity of food is so good that it keeps you  going for a long time. The home styled food was quite good and filling. The place was thronged by office goers waiting to fill them up with some carbohydrate rich stuff before setting off for the daily grind."
      },
      {
        "type": "ig",
        "url": "https://i1.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/09/IMG-20200513-WA0026.jpg"
      },
      {
        "type": "pg",
        "content": "From there we went to the iconic Puraani Litti Ki Dukan very close to the previous place for the taste of Bihar’s legendary litti and chokha. The place was abuzz with people busy eating the delicacy. We interacted with the genial owner who introduced us to the nuances of this dish. The freshly made litti and chokha tasted heavenly; especially the interplay of the flavours from mustard oil and ghee. Here we also tried crisp hot chandrakala which is a disc shaped traditional fried pastry filled with khoya and dry fruits. "
      },
      {
        "type": "ig",
        "url": "https://i2.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/09/IMG-20200513-WA0024.jpg"
      },
      {
        "type": "pg",
        "content": "We wrapped up this simple food tour with a special paan that was intended to cleanse the palate and aid digestion. The street food here is a mix of fun treats and healthy filling stuffs. The Bihar food sojourn started on an exciting note."
      }
    ],
    "time": "12",
    "badges": ["food", "veg", "patna"],
    "likes": "256",
    "author": "sn1637324823541"
  },
  {
    "id": "fd1582137000000",
    "url": "https://images.thrillophilia.com/image/upload/s--VAaCHjK4--/c_fill,h_600,q_auto,w_975/f_auto,fl_strip_profile/v1/images/photos/000/194/464/original/1611573147_c3.jpg.jpg?1611573147",
    "title": "PATNA CITY FOOD WALK",
    "gist": "During our Bihar Food Journey, we had stopped by at this place for a brief food exploration to discover it’s prominent and popular flavours.",
    "summary": "Patna City is a small neighbourhood in the capital that is full of stories from the past. It is the birthplace of Guru Gobind Singh Ji, the tenth guru of the Sikhs. Moreover it is home to one of the most sacred gurudwaras in the country named Patna Sahib Gurudwara or Takht Harmandir Sahib and so it is of great significance to the Sikh community. During our Bihar Food Journey, we had stopped by at this place for a brief food exploration to discover it’s prominent and popular flavours. Let’s tell you what all did we tried.",
    "category": "food",
    "date": "20 February 2020",
    "contents": [
      {
        "type": "pg",
        "content": "Patna City is a small neighbourhood in the capital that is full of stories from the past. It is the birthplace of Guru Gobind Singh Ji, the tenth guru of the Sikhs. Moreover it is home to one of the most sacred gurudwaras in the country named Patna Sahib Gurudwara or Takht Harmandir Sahib and so it is of great significance to the Sikh community. During our Bihar Food Journey, we had stopped by at this place for a brief food exploration to discover it’s prominent and popular flavours. Let’s tell you what all did we tried."
      },
      {
        "type": "ig",
        "url": "https://i0.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/10/IMG-20200523-WA0013.jpg"
      },
      {
        "type": "pg",
        "content": "Before starting our food tour, we visited the holy and peaceful precinct of Patna Sahib gurudwara to seek the divine blessing. After offering our prayers we headed to the langar hall where preparation for the daily community meal was underway. A team of assigned cooks and volunteers who are devotees themselves were engrossed in different tasks like cutting of vegetables, making rotis, washing and arranging the utensils etc. This voluntary service carried out in any sphere, with deep devotion for the guru and love for the brethren is called seva. Here we first partook the kada prasad and then relished the humble yet delicious meal of dal and roti at the langar hall. This eating service is open to all irrespective of religion, caste or any background. The common rule is that one needs to sit down on the floor in rows with all other devotees and eat the meal. It was quite a surreal experience."
      },
      {
        "type": "ig",
        "url": "https://i0.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/10/IMG-20200523-WA0006.jpg"
      },
      {
        "type": "pg",
        "content": "We hit the street to try the stuffs that defines the food scene of this place. First we got some kachori and ghugni from Nandu Lal kachori shop in Sabzi Bazar Chowk. The combination of crisp, small-sized sattu stuffed kachoris with an equally amazing kala chana sabzi, locally called ghugni was brilliant. This shop has been around for 100 years. No wonder their deep fried treats is phenomenal. Apart from the taste what’s laudable is the pricing which is quite reasonable. We also tried some crisp fritters made with khesari dal. The kick of garlic and chilli made them a fun treat.  "
      },
      {
        "type": "ig",
        "url": "https://i2.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/10/IMG-20200523-WA0005.jpg"
      },
      {
        "type": "pg",
        "content": "Our penultimate eating destination was  Suraj and Mahadev Gupta Sweets in Kachori Gali. It is an old sweet shop that is known for its pure milk and ghee based sweets. Our pick from the wide variety of traditional sweets included dahi, khurchan, peda and gajar burfi. Among them the khurchan was a simply a piece of art. It was a stack of pure malai layers that were lined with bhura and cardamom powder. The sweet and rich taste elated the milk lover in us. The peda and gajar burfi too were quite good. "
      },
      {
        "type": "pg",
        "content": "Finally we ended the food tour with some ber which is a highly nutritious tropical fruit native to this state. The food journey in these sleepy and holy lanes of Patna city stirred up some divine emotions that we carried back with us. "
      }
    ],
    "time": "6",
    "badges": ["food", "patna"],
    "likes": "247",
    "author": "sn1637324823541"
  },
  {
    "id": "fd1586975400000",
    "url": "https://i2.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/10/IMG-20200613-WA0047.jpg",
    "title": "GAYA FOOD TOUR",
    "gist": "Bihar’s second largest city, boasts of a vibrant street food scenario dominated by traditional fares that are loved by the locals too",
    "summary": "The ancient holy city of Gaya in Bihar, referred to as the land of enlightenment and salvation, is a sacred place for Hindu, Buddhist and Jain devotees alike. Mostly frequented by a large number of tourists and pilgrims, Bihar’s second largest city, boasts of a vibrant street food scenario dominated by traditional fares that are loved by the locals too. So let’s take you on an immersive food tour of Gaya. ",
    "category": "food",
    "date": "16 April 2020",
    "contents": [
      {
        "type": "pg",
        "content": "The ancient holy city of Gaya in Bihar, referred to as the land of enlightenment and salvation, is a sacred place for Hindu, Buddhist and Jain devotees alike. Mostly frequented by a large number of tourists and pilgrims, Bihar’s second largest city, boasts of a vibrant street food scenario dominated by traditional fares that are loved by the locals too. So let’s take you on an immersive food tour of Gaya. "
      },
      {
        "type": "pg",
        "content": "Before starting with our eating spree we first visited the Mahabodhi Temple at Bodh Gaya, one of the major Buddhist worship sites in the world. This UNESCO World Heritage site is the place where Lord Buddha had attained Enlightenment. The sprawling premises were full of monks and devotees from different parts of the world who have arrived here to seek divine blessings."
      },
      {
        "type": "ig",
        "url": "https://i1.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/10/IMG-20200613-WA0026.jpg"
      },
      {
        "type": "pg",
        "content": "On emerging from the temple complex, we noticed a few food stalls and vendors, primarily selling Tibetan fares. Here we bought some fresh phaley bread from one of the numerous ladies selling it on the roadside, headed to Three Dolma Noodles Shop and ordered some hearty rice noodles. It was fun eating the noodles in the company of a group of monks visiting from Southern India. The phaley bread went well with tea and as well as the rice noodles soup broth."
      },
      {
        "type": "ig",
        "url": "https://i2.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/10/IMG-20200613-WA0038.jpg"
      },
      {
        "type": "pg",
        "content": "Soon we then set out for Gaya and on reaching there we first offered our prayers at the famous Vishnupada temple and then began our food tour. The first stop was Rajasthani Bhojnalaya on South Church Road. As the name suggests their menu was a mix of popular Rajasthani and Bihari fares. Their no onion garlic Bihari thali containing rice, karela aloo fry, aloo rajma, dal, kadhi pakoda, spinach moong, dahi, matar paneer, makhuni etc. impressed us with its homely taste and affordability. Of these, the ghee smeared makhuni i.e sattu stuffed baked flatbread was brilliant. "
      },
      {
        "type": "ig",
        "url": "https://i0.wp.com/blog.delhifoodwalks.com/wp-content/uploads/2020/10/IMG-20200613-WA0019.jpg"
      },
      {
        "type": "pg",
        "content": "The second destination was Kesari Chaat, a family run chat centre at Dr. Haridas Chatterjee Road, Durga Bari. Their spicy, tangy and flavourful palak paneer chaat is the talk of the town. It is a well balanced pot pourri of paneer pakoda, palak sooji pakoda, chole, curd and chutneys, sev etc. This was followed by an equally brilliant aloo malpua, a syrup lagen dessert made with potatoes. "
      },
      {
        "type": "pg",
        "content": "The final destination of this immersive food tour, that spanned for the whole day was Srimani Prasad Chaat Wale in Dhamitola. Both the dish and the vendor selling it were quite fascinating. The robust aloo dum chaat was a potpourri of nearly 4 to 5 curries, chutneys and small snacks. Srimani ji was super amusing too. "
      }
    ],
    "time": "9",
    "badges": ["food", "gaya", "bihar", "tibetan"],
    "likes": "451",
    "author": "sn1637324823541"
  }
]
