[
  {
    "id": "bw1279218600000",
    "url": "https://images.firstpost.com/wp-content/uploads/2020/07/Udaan-6401.jpg?impolicy=website&width=1200&height=800",
    "title": "Udaan",
    "gist": "Expelled from his school, a 16-year old boy returns home to his abusive and oppressive father.",
    "summary": "It's not the most original movie but its got a nice progresiveness to it. It has good acting and not a very bollywoodesque style directing which makes it a little more interesting.",
    "category": "bollywood",
    "date": "16 July 2010",
    "contents": [
      {
        "type": "pg",
        "content": "After being abandoned for eight straight years in boarding school, Rohan returns to the small industrial town of Jamshedpur and finds himself closeted with an authoritarian father and a younger half brother who he didn't even know existed. Forced to work in his father's steel factory and study engineering against his wishes, he strives to forge his own life out of his given circumstances and pursue his dream of being a writer."
      },
      {
        "type": "pg",
        "content": "Vikramaditya Motwane's 'Udaan' is a film, that lingers your memory, and gives you the hope to live your dreams. The film has everything going for it, it has a touching story, proficient performances, hummable music & striking direction. It's A Winner All The Way!"
      },
      {
        "type": "pg",
        "content": "Rajat Barmecha stars as Rohan, who, after being abandoned for eight straight years in boarding school, returns to the industrial city of Jamshedpur and finds himself closeted with an authoritarian father and a younger half brother who he didn't even know existed."
      },
      {
        "type": "pg",
        "content": "'Udaan' is an inspiring story. Screenplay by Motwane & Anurag Kashyap is brilliant. Their protagonist, is not a passive one, he has a goal, that of becoming a writer, which has been stabbed by his authoritarian father. The Screenplay allows it's Hero to get courage in himself. It starts superbly, and continues it's momentum to the end."
      },
      {
        "type": "ig",
        "url": "https://1.bp.blogspot.com/__rfGD3ZOjEM/TD8tAakCQ5I/AAAAAAAAAsQ/8Cxg1psxTtw/s1600/Udaan+Movie.gif"
      },
      {
        "type": "pg",
        "content": "Motwane's direction is great as well. The Cinematography is able. Amit Trivedi's Music is hummable. The Editing is killer."
      },
      {
        "type": "pg",
        "content": "Performance-Wise: Rajat Barmecha is wonderful. The youngster lives his character each moment. Ronit Roy as the authoritarian father, is electrifying. The actor performs like never before! Aayan Boradia is a wonder child. A dependable actor! Ram Kapoor as the polite & understanding uncle, is lovable. Manjot Singh appears fictitious."
      },
      {
        "type": "pg",
        "content": "On the whole, as my summary says, One Of The Finest Films Of 2010! Strongly Reccmended!"
      }
    ],
    "time": "7",
    "badges": ["bollywood", "drama"],
    "likes": "461",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1261679400000",
    "url": "https://www.filmibeat.com/ph-big/2011/11/1322117153482891.jpg",
    "title": "3 Idiots",
    "gist": "Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them 'idiots'.",
    "summary": "Farhan Qureshi and Raju Rastogi want to re-unite with their fellow collegian, Rancho, after faking a stroke aboard an Air India plane, and excusing himself from his wife - trouser less - respectively. Enroute, they encounter another student, Chatur Ramalingam, now a successful businessman, who reminds them of a bet they had undertaken 10 years ago. The trio, while recollecting hilarious antics, including their run-ins with the Dean of Delhi's Imperial College of Engineering, Viru Sahastrabudhe, race to locate Rancho, at his last known address - little knowing the secret that was kept from them all this time.",
    "category": "bollywood",
    "date": "25 December 2009",
    "contents": [
      {
        "type": "pg",
        "content": "Like so many Indian films, this is a very, very long film--with a run-time of almost three hours. When a movie is bad or just okay, this can seem like forever, but since '3 Idiots' is a very, very good film I loved its length. And, like most films of the genre, it has its share of the usual singing and dancing so foreign to films from other countries. One thing you should know, however, is that defining the type of film it is isn't really easy. Much of it is a comedy, but it also has many poignant moments (keep the Kleenex nearby), some existential moments where they explore the meaning of life and work and it's also a tender film about friendship. And, as my daughter pointed out when she saw the film, she loved that the men in the movie are not afraid to cry--something you rarely see in western films."
      },
      {
        "type": "pg",
        "content": "As for the plot, it's very long and involved and I could recount what occurs. But I don't want to spoil a single wonderful moment, so my advice is just sit back and watch--and if you give it a chance, I can almost guarantee you'll have a great time with this poignant and funny film. Wonderful and well worth your time--with a delightful script, wonderful characters and lots of moments that made me smile...and a few that brought me to tears. See this film."
      },
      {
        "type": "pg",
        "content": "In short, 3 Idiots is a full course meal of a movie, and it has so many types and moods of movie stuffed into one, like a Turducken or something: it's a broad college comedy, an Alvin and the Chipmunks farce (think about it, with Khan's Rancho as Alvin and the other two idiots variations of Simon and Theodore, sort of, plus the Chatur character as the 4th wheel), a soap opera about strict fathers and their children, a tragic tale about suicide meant to highlight a very real problem in Indian society, and of course for Bollywood a musical, not to mention a kind of moral story of what it means to be a teacher or a student and how to not be so uptight (another subtitle for this movie could be 'The System, They Just Don't Understand!')."
      },
      {
        "type": "pg",
        "content": "It's even other things I'm sure, and the tones fluctuate and alter on a dime from one to the next. Case in point, there's a little more than mid-way through the film a very serious turn in the plot; nevermind how exactly it gets there, suffice it to say it's due to some late-night antics from Rancho with pals Raju and Farhan, with Raju most drunk the next morning in class and being forced to decide whether to be expelled or put it all on Rancho. Raju decides to jump out the window, though he doesn't die and he subsequently gets rushed to the hospital. Cue up the sad but (it can't be anything else) supremely heart-felt song that plays over as he is brought to stable condition. Then it becomes a rather crazy comedy of 'how do we wake up Raju' sequence as he is stuck in his, uh, comatose-sort of state and Rancho keeps saying wilder and wackier things to get Raju to wake up. And yet as broad as this is it's still serious... sort of."
      },
      {
        "type": "ig",
        "url": "https://stat1.bollywoodhungama.in/wp-content/uploads/2016/05/439558148.jpg"
      },
      {
        "type": "pg",
        "content": "A lot of this happens throughout 3 Idiots; for a stretch of time the movie will take on something like a frat-house comedy (that's actually how the film seems like it will take shape early on, 'initiation' sequence with butt-branding included!) but then it's (duh) also a romance with the headmaster/principal's daughter, Pia (Kapoor, pretty but also a very good actress) and Rancho since he not only is the cool/suave prankster but he also spots the phonies who try to have her hand as a significant other. But then it's also about Raju's sad (in black and white no less!) home life, and then it's also about how to function properly in an academic environment with Rancho sometimes like a, uh, RP McMurphy in Cuckoo's Nest turning the system upside down with the headmaster as the one-note headmaster. And then it gets into a musical number about things like 'All is Well', which gets finished off by someone jumping off a ledge and to their death, which makes it uh... sad again, as it cuts to the pouring rain at a funeral."
      },
      {
        "type": "pg",
        "content": "This may be de rigeur for those who are regulars for Bollywood cinema - for me, it was at times a startling experience, sometimes akin to getting whiplash on a roller-coaster. This is not to say it made the experience intolerable, however. It was surely made as a prestige/high-mainstream comedy/drama/musical-et-al, and it's the kind of movie that will have high-powered, super-slick musical set pieces (not quite as many as I expected, to be fair, and those that are here do stand out well and are the highlights of the movie aside from Khan's performance), and then for the regular musical score it will be some of the goofiest notes I've ever heard outside of a Disney channel show. And for as BIG as the actors go for this material - perhaps, you could argue, they don't have much of a choice - there are moments where there's something close to not subtlety but measured stuff; when Raju confronts his parents with what he actually wants to do with his life, it's a legitimately strong dramatic scene that pulls on the heartstrings just enough."
      },
      {
        "type": "pg",
        "content": "In other words, it's probably not what will be the *best* Bollywood movie - some may put it high up there, and that's their prerogative - but if you are new to this style of movie-making (and I don't mean Slumdog Millionaire for the laymans that's basically Bollywood crossed with Danny Boyle), it's a good place to start. It's sometimes quite funny, and sometimes quite harrowing with its drama, and often it's much too much with the emotional manipulation (that delivery scene, my God). It is what it is."
      }
    ],
    "time": "10",
    "badges": ["comedy", "bollywood", "drama"],
    "likes": "121",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1310668200000",
    "url": "https://i0.wp.com/filmeshilmy.com/wp-content/uploads/2020/07/ZNMD.jpeg?fit=3600%2C2118&ssl=1",
    "title": "Zindagi Na Milegi Dobara",
    "gist": "Three friends decide to turn their fantasy vacation into reality after one of their friends gets engaged.",
    "summary": "Three friends decide to turn their fantasy vacation into reality after one of their friends gets engaged.",
    "category": "bollywood",
    "date": "15 July 2011",
    "contents": [
      {
        "type": "pg",
        "content": "This is what buddy road trip movies are made of, and surprisingly it's helmed by a female director who managed to push all the right buttons at making this work. Zoya Akhtar, whose first film Lucy By Chance I had enjoyed tremendously as it took a long and hard look into the workings of Bollywood, reunites her brother Farhan Akhtar and Hrithik Roshan, who together with Abhay Deol form the nucleus whose adventures across Spain we follow due to a pact that's set in motion should one of them was to get married, as part of an extended 3 weeks bachelor's party plan, they were to each choose an adventure sport for everyone to partake in."
      },
      {
        "type": "pg",
        "content": "Which brings us to plenty of bro-mantic moments as they bond over death-defying stunts, and through the conquering of their fears as a group. Not to mention that the road trip across Spain provides for multiple exotic locations in which this film got shot in. Zoya Akhtar and Reema Kagti's story also contains enough depth for each character to stand out, presenting skeletons in the closet each must exorcise through their journey of discovery, though deftly avoiding melodrama. What worked is of course the chemistry between the trio of actors as they navigate their joined quest being so natural in their banter, as well as their individual character's conflicts that makes this so engaging to sit through since the challenges in their way are things easy to identify with."
      },
      {
        "type": "pg",
        "content": "The culprit who had to put the plan in motion is Kabir (Deol), whose proposal to Natasha (Kalki Koechlin) forms the basis in which his friends have to join him in executing their pact. There's the happy-go-lucky copywriter Imran (Farhan Akhtar) who's also the resident joker of the group, as well as the dead serious Arjun (Roshan) the hotshot broker whose sole objective in life is to make money, lots of it. Naturally their friendship get tested early on due to the nature of being in close proximity most of the time, but once the misunderstandings got shelved and the wheels put in motion, there's hardly a wasted scene as subplots wrap themselves up very neatly in the narrative, involving one's quest to search for his long lost father, another's realization there's more to life than work if one were to stop and smell the perennial roses, and one having to confront his doubts and the compromise of one's happiness for the sake of others."
      },
      {
        "type": "ig",
        "url": "https://images.thequint.com/thequint%2F2021-07%2F164cebd4-b9ef-4dda-af8b-8ae39a4da184%2FUntitled_design__25_.png"
      },
      {
        "type": "pg",
        "content": "There's the action-adventure level this film delivered, spending considerable time in engaging the casts in their tasks of deep sea diving, sky diving, and one signature activity best kept under wraps for its surprise factor since it ties in very closely to an important plot point. Halfway though there's also the La Tomatina festival, introduced by Laila (Katrina Kaif) their diving instructor and would be romantic interest, as an unplanned detour involving the squishing of a massive amount of tomatoes - one wonders though if the timelines of all activities do gel together so nicely since there were at least two festivals almost back to back with each other."
      },
      {
        "type": "pg",
        "content": "Hrithik Roshan didn't have much luck at the box office last year with Guzzarish and Kites, but Zindagi Na Milegi Dobara will probably put his career back on track given the meatier role of the trio he got to handle. Farhan Akhtar should act more when he's not directing his own films, while Abhay Deol after this has established himself in my books as one of the character actors to look out for. With great scenic shots and an evergreen story about friendship, camaraderie and life affirming decision making, there's nothing not to like about this film that reminds us of the ties that bind. Highly recommended as it inspires one to come up with a similar pact for a road trip."
      }
    ],
    "time": "8",
    "badges": ["bollywood", "comedy", "drama"],
    "likes": "485",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1438281000000",
    "url": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2018/07/pjimage-1533022007.jpg",
    "title": "Drishyam",
    "gist": "Desperate measures are taken by a man who tries to save his family from the dark side of the law, after they commit an unexpected crime.",
    "summary": "In a bizarre turn of events; a teenage boy goes missing; he is the son of a headstrong & no-nonsense cop; IG Meera Deshmukh and the Salgaonkar family is the prime suspect! How the family weathers the storm that ensues during the violent investigation forms the rest of the story leading to an unexpected & shocking climax.",
    "category": "bollywood",
    "date": "31 July 2015",
    "contents": [
      {
        "type": "pg",
        "content": "It's easy to feel conflicted about the story presented by 'Drishyam'. After all, there's an unjustified death that took place, and an entire family gets behind a plan to cover it up. To my thinking, the kid Sam was a victim of manslaughter and not attempted murder, but not knowing how the law deals with these things in India, I'd have to assume that the penalty would have been almost as severe as actual homicide. When Vijay Salgaonkar (Ajay Devgn) decides that he'll pull out all the stops to protect his family, the intrigue and suspense mounts in this rather offbeat thriller."
      },
      {
        "type": "pg",
        "content": "The other facet of this story that baffles me somewhat is why teenage daughter Anju (Ishita Dutta) became so distraught over the cell phone video. At first one doesn't know under what circumstances she was recorded, but it's eventually revealed that she merely went into a bathroom to change her clothes and the peeping Sam caught her in a state of undress. It's not as if she were intentionally engaging in a pornographic film. But again, different cultures look at things differently, and teenagers in particular aren't amenable to rational thought at times. So one can understand why she took matters into her own hands when Sam came calling."
      },
      {
        "type": "ig",
        "url": "https://m.media-amazon.com/images/M/MV5BYTM5YmNjMTItNjQ1Ny00MWY4LTg1MzctMzRlYWQ4OGE2YWZjXkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg"
      },
      {
        "type": "pg",
        "content": "The odd thing that occurs over the course of the picture is that the viewer finds himself siding with Vijay and the family over the cover up. That's made easier of course by the corrupt methods of the IG of Goa, portrayed by Indian actress Tabu, as well as the brutal tactics of Inspector Gaitonde (Kamlesh Sawant). If he couldn't get the three eldest members of the Salgaonkar family to crack, it was pretty much a foregone conclusion that he would have forced young Anu (Mrunal Jadhav) to talk. But by the time the authorities arrived to dig up the family's backyard, and seeing to what lengths Vijay had already gone to cover the family's tracks, I had a strong suspicion he had tampered with the grave. It was only a matter of suspense to find what he replaced Sam's body with."
      },
      {
        "type": "pg",
        "content": "Apparently this movie is a faithful remake of another Indian film with the very same title, which I find intriguing in one respect. As I write this, the film under consideration here is ranked in IMDb's Top #250 for 2016, but sits at #21 on the best films of India, while the original 'Drishyam is #2. How that anomaly occurs I wouldn't know, but it's an interesting little side note. To my mind, I think the ending of film would have been better served without the final confrontation between the Deshmukh family and Vijay, though I did find some irony in the idea that Sam was reburied under the floor of the new prison."
      }
    ],
    "time": "11",
    "badges": ["bollywood", "crime", "drama", "mystery"],
    "likes": "245",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1437676200000",
    "url": "https://m.media-amazon.com/images/M/MV5BNGVkYTdhY2MtNWE5NS00MzY5LWJkNDEtNDUxNWE5NGRlMmFjXkEyXkFqcGdeQXVyODMyODMxNDY@._V1_.jpg",
    "title": "Masaan",
    "gist": "Along India's Ganges River, four people face prejudice, a strict moral code and a punishing caste system as they confront personal tragedies.",
    "summary": "Four lives intersect along the Ganges: a low caste boy hopelessly in love, a daughter ridden with guilt of a sexual encounter ending in a tragedy, a hapless father with fading morality, and a spirited child yearning for a family, long to escape the moral constructs of a small-town.",
    "category": "bollywood",
    "date": "24 July 2015",
    "contents": [
      {
        "type": "pg",
        "content": "Neeraj Ghaywan's 'Masaan' is packed with strong performances, but as a tale, its flawed & not as gut wrenching as it believes to be. This Two-Story based narrative is certainly not without some merit, but it could've been so much more."
      },
      {
        "type": "pg",
        "content": "'Masaan' Synopsis: Four lives intersect along the Ganges: a low caste boy hopelessly in love, a daughter ridden with guilt of a sexual encounter ending in a tragedy, a hapless father with fading morality, and a spirited child yearning for a family, long to escape the moral constructs of a small-town."
      },
      {
        "type": "pg",
        "content": "'Masaan' aces in its first story, which is genuinely tragic. The father-daughter angle is powerfully handled, offering moments so real, they literally hit you like ton of bricks. My problem was with the second story. I couldn't care less for the low-caste boy who falls for a girl, who turns out to be his opposite, in terms of caste."
      },
      {
        "type": "ig",
        "url": "https://lh3.googleusercontent.com/proxy/bb5he02-ymEecwOEpD7u9yc4jjLgXumteQTDA2aiVj3gEodtcQI60XgCwVTeZEenkKZLOfemd8gJB8wpgLfy8yugcGQIM0_Ogqi-Jkmn6IleUWTiYhHvjqggmBgoRUDe_LL9OpZxSTQEfsQsM1hQUxP1qMhF9jKO56jONdN-P8oM-_uqYwz9ESdrgN4C2o_ecn8U-c-E3ulBT9fRnuqGR0mW8pzJ6uJ5"
      },
      {
        "type": "pg",
        "content": "Ghaywan & Varun Grover's Screenplay solidly builds one story, but fails in the another one. I wasn't repulsed by the goings-on, although the Writing aims to disturb you. The Writing needed to be sharper. Ghaywan's Direction is good. Cinematography & Editing are perfectly done."
      },
      {
        "type": "pg",
        "content": "Performance-Wise: Richa Chadda & Sanjay Mishra lead 'Masaan', with heartbreaking performances. As the conflicting father-daughter, Chadda & Mishra deliver magnificently. Newcomer Vicky Kaushal & Shweta Tripathi are sincere. Pankaj Tripathi is priceless in a cameo."
      },
      {
        "type": "pg",
        "content": "On the whole, 'Masaan' isn't as powerful as it hopes to be, but its still worth a watch for the performances."
      }
    ],
    "time": "10",
    "badges": ["bollywood", "drama"],
    "likes": "520",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1373481000000",
    "url": "https://variety.com/wp-content/uploads/2013/07/bhaag-milkha-bhaag.jpg",
    "title": "Bhaag Milkha Bhaag",
    "gist": "The truth behind the ascension of Milkha Singh who was scarred because of the India-Pakistan partition.",
    "summary": "The true story of the 'Flying Sikh' - world champion runner and Olympian Milkha Singh -- who overcame the massacre of his family, civil war during the India-Pakistan partition, and homelessness to become one of India's most iconic athletes.",
    "category": "bollywood",
    "date": "11 July 2013",
    "contents": [
      {
        "type": "pg",
        "content": "'Bhaag Milkha Bhaag' is a film about the life of Milkha Singh--a man who is beloved in India but who I'd never heard about before I saw this movie. He is about the most famous Olympic non-winner you can find--and the film begins with him coming in 4th in the 400 at the Rome Olympics."
      },
      {
        "type": "pg",
        "content": "The film is non-liner in style, as it goes from this even in 1960 back a few years to when Singh enlisted in the Indian Army to his childhood. But, unusually, it bounces back and forth repeatedly--and might confuse some viewers."
      },
      {
        "type": "ig",
        "url": "https://www.filmibeat.com/img/2013/06/05-sonam-farhan-b-050613.jpg"
      },
      {
        "type": "pg",
        "content": "The big reason for this film is not only because Singh was a three-time Olympian (only two times are mentioned in the film) or an Asian champion but because of his roots. He was born in a region that was India but became part of Pakistan after the partition in 1947. This was a serious problem for Singh and his family, as they were Sikhs--and non-Muslims were apparently not welcome there. This isn't surprising, as the partition resulted in the deaths of anywhere from 200,000 to a million according to some estimates--on both sides of the border (everybody seemed to be killing each other in the name of god!). So, that Singh's family was displaced and his father murdered isn't surprising. Years later, the Indians and Pakistanis were planning a joint competition--and Singh would be an important part of that team. However, because of his past, his participation was doubtful and the film chronicles this."
      },
      {
        "type": "pg",
        "content": "While this is a sports drama, I wasn't surprised that, yes, there were still several song and dance numbers. Not all Indian films have this but a huge percentage do--so expect a few nice musical interludes. Additionally, expect AMAZING cinematography, direction and special effects--making it equal in quality to the films of any nation. What really impressed me as well as Farhan Akhtar as Singh. Farhan really buffed himself up for the film and was a very impressive looking guy with his taut figure and muscles. He really LOOKED like a world-class athlete. Overall, an enjoyable film and one well worth your time."
      }
    ],
    "time": "9",
    "badges": ["bollywood", "drama", "sport", "biography"],
    "likes": "461",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1394130600000",
    "url": "https://www.filmibeat.com/ph-big/2014/02/kangna-ranaut-still-from-film-queen_139288557480.jpg",
    "title": "Queen",
    "gist": "A Delhi girl from a traditional family sets out on a solo honeymoon after her marriage gets cancelled.",
    "summary": "Queen is a movie about growing up. Rani (Kangana Ranaut) is a Delhi girl from a conservative family who is ditched by her fiancé just before her wedding. Shocked by this, she decides to set out on the planned honeymoon alone. As she travels the world and meets new people, she gains new experiences and discovers her own identity.",
    "category": "bollywood",
    "date": "7 March 2014",
    "contents": [
      {
        "type": "pg",
        "content": "Directed by Vikas Bahl, QUEEN actually works instantly since it breaks all the set molds of a Hindi film as soon as the girl moves out to her foreign destination to enjoy a honeymoon alone! And when in Paris, you get to see her coming out of her closed, conservative shell like no other Hindi film has shown till date, to be honest. Yes, the plot does remind you of films such as FRENCH KISS (1995) and our own English VINGLISH (2012) also based on a lady's self discovery. But the similarities end right there and QUEEN comes out as a true representative of the new age entertaining cinema, we have been looking for from quite long."
      },
      {
        "type": "pg",
        "content": "The film is a winner straight away since it remains unpredictable right from its first scene till the last, offering many unseen sequences in a remarkable style. And then it's a very fresh, lively and honest depiction of the foreign life which truly adds to the overall feel of the film quite brilliantly. The other major winning perspective of QUEEN is that this is not a stereotype love story being told with a foreign angle. In fact it is not a love story at all in the first place and is more about the blessed journey of a depressed girl, who rediscovers a new self, after meeting another girl living her life at her own terms all alone, taking its full responsibility whatsoever."
      },
      {
        "type": "pg",
        "content": "So actually QUEEN is all about women-liberation, but this liberation is not meant from any evil clutches of the men. On the contrary here the liberation is pointing towards getting free from herself and from her own set parameters which force her to questionably give away the reins of her life in the hands of a man, without asking any questions or getting any clear commitments for the future. It's a 150 minutes joyride which is certainly going to be enjoyed more by the women as its about them and their undisclosed aspirations only which remain hidden in most of the cases just to get buried or burnt along with their lifeless bodies in the end. So for a change, here we have the men playing the supporting cast taking the rarely acquired back seat and the film is all about the women superbly led by one of the most under-rated actress of our times, Kangana Ranaut."
      },
      {
        "type": "ig",
        "url": "https://www.filmibeat.com/ph-big/2014/01/kangna-ranaut-still-from-film-queen_1388647010100.jpg"
      },
      {
        "type": "pg",
        "content": "As clearly conveyed in its promos, QUEEN begins with Kangana and ends on Kangana too like very few Hindi films dare to do. The immensely talented girl who was mostly considered as a misfit in the fixed Bollywood format earlier just grabs this rare opportunity thrown towards her like a wounded tigress and then delivers a performance which is sure going to give a tough competition to her contemporaries like Parineeti Chopra, Alia Bhatt and more in the next rounds of awards ceremonies, without any doubt. Her flawless, natural act is simply spectacular in the film as Rani played in a cheerful mode. Plus such is the innocent brilliance in her truthful performance that the viewer just has the girl only in his or her mind while walking out of the theater and that too with all positivity and smile on the faces in a highly satisfying mode."
      },
      {
        "type": "pg",
        "content": "However beginning with a highly enjoyable & entertaining first half, the film does tend to become a bit long in its few sequences of the second half (which required a wise editing). Plus it also takes some (fairly allowed) cinematic liberties in its basic storyline too leaving quite a few things unexplained about its key characters in the end. But fortunately Kangana never lets you feel these shortcomings frankly and the progression even makes a more solid impact once she returns back home and decides to do the unexpected quite daringly. The climax fills in a new life back into the film and I was really relieved that it didn't have something of the routine in its final moments."
      },
      {
        "type": "pg",
        "content": "Apart from the spellbinding act by Kangana, the other great insightful features of the film deserving a special mention are its writing (dialogues), cinematography, costume designing and background score which give an extremely important and appreciable edge to the product in terms of 'A Balance maintained.'"
      },
      {
        "type": "pg",
        "content": "Musically, QUEEN has indeed got a worth listening, interesting soundtrack with a few peppy dancing tracks like 'London Thumakda', 'O Gujariya', 'Jugni' and more soothing ones such as 'Badra Bahaar', 'Taake Jhaanke', 'Harjaaiyan', 'Ranjha' & 'Kinare' sung well. Moreover it also teaches how a perfect tribute can be paid to the great songs of our Golden Era by using the track 'Maine Hothon Se Lagayi To' from ANHONEE in a superb style with some fine added arrangements."
      },
      {
        "type": "ig",
        "url": "https://static.toiimg.com/photo/msid-31528654/31528654.jpg?53275"
      },
      {
        "type": "pg",
        "content": "In the supporting cast, Rajkummar Rao shines in his short role and it was really sporting of him to accept such a miniscule part at this crucial time of his career. Lisa Haydon is truly a delight to watch both in terms of beauty and dialogues complimenting Kangana in her every next step with confidence and all the foreign actors do add their own bit sincerely to make it a worth watching film in its final hour. Still, the ones really giving you a great time in the theater are the actors playing Kangana's family members especially the father, kid brother and the grandmother giving her a lovely life teaching advice sitting out of the locked door."
      },
      {
        "type": "pg",
        "content": "To sum up QUEEN is a charmingly entertaining film, which many might rate as just a multiplex movie or something taking our Indian traditions for a toss and more. But for others QUEEN is the next step forward in our Indian Cinema and the effort surely needs to be applauded by one and all, loudly."
      }
    ],
    "time": "12",
    "badges": ["bollywood", "comedy", "drama", "adventure"],
    "likes": "319",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1331231400000",
    "url": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2016/12/02/524885-26tweet1.jpg",
    "title": "Kahaani",
    "gist": "A pregnant woman's search for her missing husband takes her from London to Kolkata, but everyone she questions denies having ever met him.",
    "summary": "Kolkata is abuzz with the preparations for the annual Durga Puja festival, as seven months pregnant Vidya Bagchi steps off the airplane from London. Her first stop is the local police station to file a missing person report. Weeks ago, her husband Arnab arrived in India for a job assignment. The first two weeks, they talked daily on the phone, and then without explanation, his calls stopped. Everywhere Vidya turns, no one can remember Arnab. There is no trace of him at the guest house or his workplace. But Vidya will not give up her search. Somewhere in Kolkata she will discover the dangerous truth",
    "category": "bollywood",
    "date": "9 March 2012",
    "contents": [
      {
        "type": "pg",
        "content": "If you are looking for a typical sort of Bollywood film where you have a romance and LOTS of singing, then 'Kahaani' is not for you. While I like the former sort of film, here in the States MOST Indian films we get are like that and so it's nice to have something very different--and 'Kahaani' is very different."
      },
      {
        "type": "pg",
        "content": "Vidya Balan plays a woman named Vidya. She's lived in London and although she speaks Hindi, she is very westernized. So, when her husband, Arnab, disappears, she is not like a typical Indian woman--she goes looking for him--even if it means leaving her London home when she is obviously VERY pregnant (heck, she looks like she's ready to explode during the film!). However, when she arrives in Kolkata, she finds no evidence that Arnab ever went there on a business trip. The police assist her but they also come up with nothing. However, the woman in human resources where Arnab claimed to be working thinks that perhaps Arnab is a DIFFERENT employee--a guy name Milan that worked there two years ago. Unfortunately for the H.R. woman, this ends up costing her her life! Obviously something very bad and very dangerous is afoot. To discover exactly what and who's behind it, watch 'Kahaani'. I could tell you more--as the film really packs a lot into only two hours--but it also would impact your enjoyment and give away way too much. Just see the film."
      },
      {
        "type": "ig",
        "url": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2020/04/28/Pictures/_4a39a422-8918-11ea-9509-5815dbde8d81.jpg"
      },
      {
        "type": "pg",
        "content": "There really isn't much to complain about in this film. The writing is VERY original but more importantly, it's very INTELLIGENTLY written and is made for an audience who doesn't mind a complex plot or strong female lead--especially for an Indian film. I also LOVED the balding assassin--he was so scary because he seemed so incredibly ordinary! All in all, a great film--one of the best I've seen from India and comparable to the best stuff made anywhere."
      }
    ],
    "time": "10",
    "badges": ["bollywood", "mistery", "thriller"],
    "likes": "253",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1138213800000",
    "url": "https://m.media-amazon.com/images/M/MV5BODI5ZGVhY2ItYTFlMi00MjBhLTk5YTItNzg4NmZlZWEzNWIzXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_.jpg",
    "title": "Rang De Basanti",
    "gist": "The story of six young Indians who assist an English woman to film a documentary on the freedom fighters from their past, and the events that lead them to relive the long-forgotten saga of freedom.",
    "summary": "Sue comes to India to make a film on Indian revolutionaries. She is helped by her friend Sonia who introduces her to her friends Karan, Aslam, Sukhi, and their head DJ. Sonia's fiance, Lt Ajay Rathod, also joins the gang when in town. Their gang always gets in trouble with political member Laxman who opposes their Western culture. After many auditions Sue decides to cast DJ and his friends in her film; she also gives Laxman a role, ending his feud with the gang. Everything goes well until Ajay dies in a plane crash but manages to save everyone else on board. The state minister declares that Ajay died due to his own negligence. DJ an his friends can't take this shame given to Ajay by the minister and decide to fight for justice, but political games interfere.",
    "category": "bollywood",
    "date": "26 January 2006",
    "contents": [
      {
        "type": "pg",
        "content": "Sue is a pretty young British lady who wants to make a film about the Indian uprising of the 1920s. This is because she's read through her grandfather's diary and although he was a British officer, he had great respect for these Indian patriots. But her bosses have no interest in such a project (perhaps because she's in the UK), so she takes off for India to do the film herself...with no funding. But because there is no money, she decides to use some college students instead of professional actors. There is a huge problem, though, as the students are mostly very spoiled young people who are more interested in becoming like Westerners than doing a serious film about their forefathers. Can she get through to these jerks and get them to realize the great price that was paid to create modern day India....and thus get the film made?"
      },
      {
        "type": "ig",
        "url": "https://occ-0-1723-1722.1.nflxso.net/dnm/api/v6/E8vDc_W8CLv7-yMQu8KMEC7Rrr8/AAAABTLvyHuqI7JoGOsljH6mhvFf5gS1zMtfDOl2m4O06ol3eJ6JQd8FsVzxPzJnh3wezhIUy2Moz2jEkbuLWrkZx3Oo4uQ6.jpg?r=504"
      },
      {
        "type": "pg",
        "content": "Like most Indian films, this one is quite long--nearly three hours. And, like a typical Indian film is shows a lot of fun-loving young Indians singing and dancing. I liked the film but think they overdid this aspect a bit. The students should have been oblivious to their past but making them annoying jerks seemed a bit too much, as it was very hard to like any of them during the first portion of the picture. A bit more subtlety would have been nice. Fortunately, through the course of the film, the students did improve in this regard and began to take the project more seriously. This later portion was much better and poignant, as the students start to realize that even today in India there is corruption and repression that must be fought and it's a close parallel to the story about the Indian revolutionaries of the 1920s. I am pretty sure the Indian politicians did NOT appreciate this film and its condemnation of brutal police tactics to squelch protest! Overall, despite being uneven, the film is quite good and interesting as it seems to encourage what might be perceived as terrorism! A very compelling film despite the slow start."
      },
      {
        "type": "pg",
        "content": "By the way, the MiG-21 crashes which made up a significant part of the latter portion of film have apparently been a serious problem in India. And yet, the film says at the beginning that it's a work of fiction...interesting. Also, for Westerners not used to Bollywood films, you might be interested to hear that corruption (particularly police corruption) is a relatively common theme in Indian films."
      }
    ],
    "time": "12",
    "badges": ["bollywood", "comedy", "crime", "drama"],
    "likes": "793",
    "author": "sn1637324823541"
  },
  {
    "id": "bw1186684200000",
    "url": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/08/09/Pictures/_4980d7a6-7d06-11e7-a713-31f90463e8eb.jpg",
    "title": "Chakde! India",
    "gist": "Kabir Khan, the coach of the Indian Women's National Hockey Team, dreams of making his all-girls team emerge victorious against all odds.",
    "summary": "CHAK DE INDIA is the story of a coach's fight of making his team, Team India by overcoming their diverse backgrounds, by learning to use everything that life hurls on them as a secret weapon. It's a story about honesty, sincerity and integrity.",
    "category": "bollywood",
    "date": "10 August 2007",
    "contents": [
      {
        "type": "pg",
        "content": "I am not what you would call a sports fan. I do not get any vicarious thrill watching someone else do what I can't. I appreciate great sportsmen/women like Tiger Woods or Lorena Ochoa or Danica Patrick, but I generally avoid watching unless it is a national event like the World Cup or the Olympics."
      },
      {
        "type": "pg",
        "content": "Having said that, I am a huge fan of sports movies. They are a source of excitement and inspiration if they are done well. This one is one of the best that I have seen."
      },
      {
        "type": "ig",
        "url": "https://m.media-amazon.com/images/M/MV5BMTk2NjUzMzc2OV5BMl5BanBnXkFtZTgwMDM4MTcxMzI@._V1_.jpg"
      },
      {
        "type": "pg",
        "content": "It has so many good points, that it is hard to list them all. The obsession with national pride and the fact that a star player is scapegoated for a loss is first and foremost in this film. We are all allowed to make one mistake, aren't we? Not if your mistake costs the country to lose a title and lose face to a huge enemy. Kabir Khan (Shahrukh Khan) made such a mistake and it caused him to leave his home and go into exile for seven years."
      },
      {
        "type": "pg",
        "content": "He returned to take a job that no one wanted. He would coach a women's hockey team to the World Championships. No one wanted it because it was a women's team, and we all know that is usually just a Title IX requirement and not to be taken seriously. In fact, they didn't even want to fund the trip to the World Championships after he trained the team. Money was to be used for a men's team. Women belong barefoot and pregnant and in the kitchen, as one Arkansas politician put it some years ago."
      },
      {
        "type": "pg",
        "content": "To watch 150+ minutes of women's hockey, you have to have one hell of a story and some very interesting characters. The challenge of Khan transforming sixteen championship players from all over India into a team that puts India first, was mesmerizing. You know how the story will end. It ends as all sports movies do, but it is the journey that is fascinating. To see the neanderthal attitudes of the country transformed through excellence in sport is both exciting and sad. (Don't be so smug, America, your record on women isn't too much better.) If you are looking for an exciting movie that will thrill you beyond belief, then this is the one. Do not miss it."
      }
    ],
    "time": "12",
    "badges": ["bollywood", "drama", "family", "sport"],
    "likes": "365",
    "author": "sn1637324823541"
  }
]
